ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/MSS_CTRL_MSS_CTRL_50D00000h.xml
<module name="MSS_CTRL" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="MSS_CTRL_R5SS0_CONTROL" acronym="MSS_CTRL_R5SS0_CONTROL" offset="32" width="32" description="This register is used to configure R5SS0 in Lock step or Dual core mode. The mode change can be affected only once in a SOC power cycle.">
		<bitfield id="R5SS0_CONTROL_ROM_WAIT_STATE" width="3" begin="26" end="24" resetval="0x0" description="Writing 3'b111  enables a single cycle wait state with respect to CR5A_clk for rom access.This needs to be set when R5 clock is at 400MHZ and Interconnect-clk is at 200MHZ. [because it is a timing issue in this scenario]" range="26:24" rwaccess="R/W"/>
	<bitfield id="R5SS0_CONTROL_RESET_FSM_TRIGGER" width="3" begin="18" end="16" resetval="0x0" description="Write pulse bit field:Writing 3'b111 will trigger the reset FSM. Reset FSM ensures reset to R5SS and inturn ensures the latching of lock_step and also mem_swap bit" range="18:16" rwaccess="R/W"/>
	<bitfield id="R5SS0_CONTROL_LOCK_STEP_SWITCH_WAIT" width="3" begin="10" end="8" resetval="0x7" description="Writing 3'b111 ensures switch happens only after R5SS reset. Orelse it will be a immediate switch." range="10:8" rwaccess="R/W"/>
	<bitfield id="R5SS0_CONTROL_LOCK_STEP" width="3" begin="2" end="0" resetval="0x7" description="Writing 3'b000 ensures R5 to be in Dual-Core mode. Note: The change happens after the R5SS reset assertion if corresponding R5SS_CONTROL_LOCK_STEP_SWITCH_WAIT is set. Or else the switiching to Dual-core happens on the fly." range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS0_CORE0_HALT" acronym="MSS_CTRL_R5SS0_CORE0_HALT" offset="36" width="32" description="This register is used to Halt or Unhalt R5SS0 Core 0">
		<bitfield id="R5SS0_COREA_HALT_HALT" width="3" begin="2" end="0" resetval="0x7" description="Writing 3'b000  will unhalt CR5A. This register should be written only once." range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS0_CORE1_HALT" acronym="MSS_CTRL_R5SS0_CORE1_HALT" offset="40" width="32" description="This register is used to Halt or Unhalt R5SS0 Core 1">
		<bitfield id="R5SS0_COREB_HALT_HALT" width="3" begin="2" end="0" resetval="0x7" description="Writing 3'b000  will unhalt for CR5B.  This register should be written only once." range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS0_STATUS_REG" acronym="MSS_CTRL_R5SS0_STATUS_REG" offset="44" width="32" description="This register shows whether R5SS0 is in Lock step or Dual core mode.">
		<bitfield id="R5SS0_STATUS_REG_LOCK_STEP" width="1" begin="8" end="8" resetval="0x0" description="Reading1:confirms R5SS is in lockstep mode. Reading0:confirms R5SS is in Dual-core mode." range="8" rwaccess="R"/>
	<bitfield id="R5SS0_STATUS_REG_MEMSWAP" width="1" begin="0" end="0" resetval="0x0" description="Reading1:confirms ROM is Eclipsed from with RAM for R5." range="0" rwaccess="R"/>
	</register><register id="MSS_CTRL_R5SS0_CORE0_STAT" acronym="MSS_CTRL_R5SS0_CORE0_STAT" offset="48" width="32" description="This register shows the WFI WFE status of R5SS0 Core 0">
		<bitfield id="R5SS0_CORE0_STAT_WFE_STAT" width="1" begin="4" end="4" resetval="0x0" description="WFE Status" range="4" rwaccess="R"/>
	<bitfield id="R5SS0_CORE0_STAT_WFI_STAT" width="1" begin="0" end="0" resetval="0x0" description="WFI Status" range="0" rwaccess="R"/>
	</register><register id="MSS_CTRL_R5SS0_CORE1_STAT" acronym="MSS_CTRL_R5SS0_CORE1_STAT" offset="52" width="32" description="This register shows the WFI WFE status of R5SS0 Core 1">
		<bitfield id="R5SS0_CORE1_STAT_WFE_STAT" width="1" begin="4" end="4" resetval="0x0" description="WFE Status" range="4" rwaccess="R"/>
	<bitfield id="R5SS0_CORE1_STAT_WFI_STAT" width="1" begin="0" end="0" resetval="0x0" description="WFI Status" range="0" rwaccess="R"/>
	</register><register id="MSS_CTRL_MSS_STC_CONTROL0" acronym="MSS_CTRL_MSS_STC_CONTROL0" offset="56" width="32" description="This register is used to  override and force WFI from  R5SS0 to RCM.">
		<bitfield id="MSS_STC_CONTROL0_CR5_WFI_OVERIDE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will force the wfi signals of R5SS to 1" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS1_CONTROL" acronym="MSS_CTRL_R5SS1_CONTROL" offset="64" width="32" description="This register is used to configure corresponding R5SS in Lock step or Dual core mode. The mode change can be affected only once in a SOC power cycle.">
		<bitfield id="R5SS1_CONTROL_RESET_FSM_TRIGGER" width="3" begin="18" end="16" resetval="0x0" description="Write pulse bit field:Writing 3'b111 will trigger the reset FSM. Reset FSM ensures reset to R5SS and inturn ensures the latching of lock_step and also mem_swap bit" range="18:16" rwaccess="R/W"/>
	<bitfield id="R5SS1_CONTROL_LOCK_STEP_SWITCH_WAIT" width="3" begin="10" end="8" resetval="0x7" description="Writing 3'b111 ensures switch happens only after R5SS reset. Orelse it will be a immediate switch." range="10:8" rwaccess="R/W"/>
	<bitfield id="R5SS1_CONTROL_LOCK_STEP" width="3" begin="2" end="0" resetval="0x7" description="Writing 3'b000 ensures R5 to be in Dual-Core mode. Note: The change happens after the R5SS reset assertion if corresponding R5SS_CONTROL_LOCK_STEP_SWITCH_WAIT is set. Or else the switiching to Dual-core happens on the fly." range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS1_CORE0_HALT" acronym="MSS_CTRL_R5SS1_CORE0_HALT" offset="68" width="32" description="This register is used to Halt or Unhalt R5SS1 Core 0">
		<bitfield id="R5SS1_COREA_HALT_HALT" width="3" begin="2" end="0" resetval="0x7" description="Writing 3'b000  will unhalt CR5A. This register should be written only once." range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS1_CORE1_HALT" acronym="MSS_CTRL_R5SS1_CORE1_HALT" offset="72" width="32" description="This register is used to Halt or Unhalt R5SS1 Core 1">
		<bitfield id="R5SS1_COREB_HALT_HALT" width="3" begin="2" end="0" resetval="0x7" description="Writing 3'b000  will unhalt for CR5B.  This register should be written only once." range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS1_STATUS_REG" acronym="MSS_CTRL_R5SS1_STATUS_REG" offset="76" width="32" description="This register shows whether R5SS1 is in Lock step or Dual core mode.">
		<bitfield id="R5SS1_STATUS_REG_LOCK_STEP" width="1" begin="8" end="8" resetval="0x0" description="Reading1:confirms R5SS is in lockstep mode. Reading0:confirms R5SS is in Dual-core mode." range="8" rwaccess="R"/>
	</register><register id="MSS_CTRL_R5SS1_CORE0_STAT" acronym="MSS_CTRL_R5SS1_CORE0_STAT" offset="80" width="32" description="This register shows the WFI WFE status of R5SS1 Core 0">
		<bitfield id="R5SS1_CORE0_STAT_WFE_STAT" width="1" begin="4" end="4" resetval="0x0" description="WFE Status" range="4" rwaccess="R"/>
	<bitfield id="R5SS1_CORE0_STAT_WFI_STAT" width="1" begin="0" end="0" resetval="0x0" description="WFI Status" range="0" rwaccess="R"/>
	</register><register id="MSS_CTRL_R5SS1_CORE1_STAT" acronym="MSS_CTRL_R5SS1_CORE1_STAT" offset="84" width="32" description="This register shows the WFI WFE status of R5SS1 Core 1">
		<bitfield id="R5SS1_CORE1_STAT_WFE_STAT" width="1" begin="4" end="4" resetval="0x0" description="WFE Status" range="4" rwaccess="R"/>
	<bitfield id="R5SS1_CORE1_STAT_WFI_STAT" width="1" begin="0" end="0" resetval="0x0" description="WFI Status" range="0" rwaccess="R"/>
	</register><register id="MSS_CTRL_MSS_STC_CONTROL1" acronym="MSS_CTRL_MSS_STC_CONTROL1" offset="88" width="32" description="This register is used to  override and force WFI from  R5SS1 to RCM.">
		<bitfield id="MSS_STC_CONTROL1_CR5_WFI_OVERIDE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will force the wfi signals of R5SS to 1" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS0_ROM_ECLIPSE" acronym="MSS_CTRL_R5SS0_ROM_ECLIPSE" offset="128" width="32" description="R5_ROM_ECLIPSE.">
		<bitfield id="R5SS0_ROM_ECLIPSE_MEMSWAP_WAIT" width="3" begin="10" end="8" resetval="0x7" description="Writing 3'b111 ensures ROM-Eclipsing happens only after R5SS reset. Or else it will be a immediate change." range="10:8" rwaccess="R/W"/>
	<bitfield id="R5SS0_ROM_ECLIPSE_MEMSWAP" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 ensures eclipsing of CR5A_ROM immediately if memswap_wait is not set. If memswap_wait is set then ROM is eclipsed after R5SS reset assertion." range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_BOOT_INFO_REG0" acronym="MSS_CTRL_MSS_BOOT_INFO_REG0" offset="256" width="32" description="MSS_BOOT_INFO_REG0.">
		<bitfield id="MSS_BOOT_INFO_REG0_CONFIG" width="32" begin="31" end="0" resetval="0x0" description="Reserved Register for Software use**Note: Bit is getting reseted only on PORz" range="31:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_BOOT_INFO_REG1" acronym="MSS_CTRL_MSS_BOOT_INFO_REG1" offset="260" width="32" description="MSS_BOOT_INFO_REG1.">
		<bitfield id="MSS_BOOT_INFO_REG1_CONFIG" width="32" begin="31" end="0" resetval="0x0" description="Reserved Register for Software use**Note: Bit is getting reseted only on PORz" range="31:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_BOOT_INFO_REG2" acronym="MSS_CTRL_MSS_BOOT_INFO_REG2" offset="264" width="32" description="MSS_BOOT_INFO_REG2.">
		<bitfield id="MSS_BOOT_INFO_REG2_CONFIG" width="32" begin="31" end="0" resetval="0x0" description="Reserved Register for Software use**Note: Bit is getting reseted only on PORz" range="31:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_BOOT_INFO_REG3" acronym="MSS_CTRL_MSS_BOOT_INFO_REG3" offset="268" width="32" description="MSS_BOOT_INFO_REG3.">
		<bitfield id="MSS_BOOT_INFO_REG3_CONFIG" width="32" begin="31" end="0" resetval="0x0" description="Reserved Register for Software use**Note: Bit is getting reseted only on PORz" range="31:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_BOOT_INFO_REG4" acronym="MSS_CTRL_MSS_BOOT_INFO_REG4" offset="272" width="32" description="MSS_BOOT_INFO_REG4.">
		<bitfield id="MSS_BOOT_INFO_REG4_CONFIG" width="32" begin="31" end="0" resetval="0x0" description="Reserved Register for Software use**Note: Bit is getting reseted only on PORz" range="31:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_BOOT_INFO_REG5" acronym="MSS_CTRL_MSS_BOOT_INFO_REG5" offset="276" width="32" description="MSS_BOOT_INFO_REG5.">
		<bitfield id="MSS_BOOT_INFO_REG5_CONFIG" width="32" begin="31" end="0" resetval="0x0" description="Reserved Register for Software use**Note: Bit is getting reseted only on PORz" range="31:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_BOOT_INFO_REG6" acronym="MSS_CTRL_MSS_BOOT_INFO_REG6" offset="280" width="32" description="MSS_BOOT_INFO_REG6.">
		<bitfield id="MSS_BOOT_INFO_REG6_CONFIG" width="32" begin="31" end="0" resetval="0x0" description="Reserved Register for Software use**Note: Bit is getting reseted only on PORz" range="31:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_BOOT_INFO_REG7" acronym="MSS_CTRL_MSS_BOOT_INFO_REG7" offset="284" width="32" description="MSS_BOOT_INFO_REG7.">
		<bitfield id="MSS_BOOT_INFO_REG7_CONFIG" width="32" begin="31" end="0" resetval="0x0" description="Reserved Register for Software use**Note: Bit is getting reseted only on PORz" range="31:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_ATCM0_MEM_INIT" acronym="MSS_CTRL_MSS_ATCM0_MEM_INIT" offset="512" width="32" description="This register is used to initialise the data and ECC of ATCM memory of R5SS0 .">
		<bitfield id="MSS_ATCM0_MEM_INIT_MEM_INIT" width="1" begin="0" end="0" resetval="0x0" description="Write_pulse bit field:Writing 1'b1 will start initializing the ATCM banks of CR5A/B. Value in each row is initialized to 0x0C_0000_0000" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_ATCM0_MEM_INIT_DONE" acronym="MSS_CTRL_MSS_ATCM0_MEM_INIT_DONE" offset="516" width="32" description="This register is used to indicate the ATCM memory initialization completion for R5SS0.">
		<bitfield id="MSS_ATCM0_MEM_INIT_DONE_MEM_INIT_DONE" width="1" begin="0" end="0" resetval="0x0" description="This field will be high once initialization of ATCM banks is finished. Writing '1' would clear the bit." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_ATCM0_MEM_INIT_STATUS" acronym="MSS_CTRL_MSS_ATCM0_MEM_INIT_STATUS" offset="520" width="32" description="This register is used to indicate the status of ongoing memory initialization for ATCM memory of R5SS0.">
		<bitfield id="MSS_ATCM0_MEM_INIT_STATUS_MEM_STATUS" width="1" begin="0" end="0" resetval="0x0" description="1'b0: No initialization is happening for ATCM banks of CR5A/B1'b1: Initialization is in progress for ATCM banks of CR5A/B" range="0" rwaccess="R"/>
	</register><register id="MSS_CTRL_MSS_BTCM0_MEM_INIT" acronym="MSS_CTRL_MSS_BTCM0_MEM_INIT" offset="528" width="32" description="This register is used to initialise the data and ECC of BTCM memory of R5SS0 .">
		<bitfield id="MSS_BTCM0_MEM_INIT_MEM_INIT" width="1" begin="0" end="0" resetval="0x0" description="Write_pulse bit field:Writing 1'b1 will start initializing the B0/1TCM banks of CR5A/B" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_BTCM0_MEM_INIT_DONE" acronym="MSS_CTRL_MSS_BTCM0_MEM_INIT_DONE" offset="532" width="32" description="This register is used to indicate the BTCM memory initialization completion for R5SS0.">
		<bitfield id="MSS_BTCM0_MEM_INIT_DONE_MEM_INIT_DONE" width="1" begin="0" end="0" resetval="0x0" description="This field will be high once initialization of B0/1TCM banks is finished. Writing '1' would clear the bit." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_BTCM0_MEM_INIT_STATUS" acronym="MSS_CTRL_MSS_BTCM0_MEM_INIT_STATUS" offset="536" width="32" description="This register is used to indicate the status of ongoing memory initialization for BTCM memory of R5SS0.">
		<bitfield id="MSS_BTCM0_MEM_INIT_STATUS_MEM_STATUS" width="1" begin="0" end="0" resetval="0x0" description="1'b0: No initialization is happening for B0/1TCM banks of CR5A/B1'b1: Initialization is in progress for B0/1TCM banks of CR5A/B" range="0" rwaccess="R"/>
	</register><register id="MSS_CTRL_MSS_ATCM1_MEM_INIT" acronym="MSS_CTRL_MSS_ATCM1_MEM_INIT" offset="544" width="32" description="This register is used to initialise the data and ECC of ATCM memory of R5SS1.">
		<bitfield id="MSS_ATCM1_MEM_INIT_MEM_INIT" width="1" begin="0" end="0" resetval="0x0" description="Write_pulse bit field:Writing 1'b1 will start initializing the ATCM banks of CR5A/B. Value in each row is initialized to 0x0C_0000_0000" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_ATCM1_MEM_INIT_DONE" acronym="MSS_CTRL_MSS_ATCM1_MEM_INIT_DONE" offset="548" width="32" description="This register is used to indicate the ATCM memory initialization completion for R5SS1.">
		<bitfield id="MSS_ATCM1_MEM_INIT_DONE_MEM_INIT_DONE" width="1" begin="0" end="0" resetval="0x0" description="This field will be high once initialization of ATCM banks is finished. Writing '1' would clear the bit." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_ATCM1_MEM_INIT_STATUS" acronym="MSS_CTRL_MSS_ATCM1_MEM_INIT_STATUS" offset="552" width="32" description="This register is used to indicate the status of ongoing memory initialization for ATCM memory of R5SS1.">
		<bitfield id="MSS_ATCM1_MEM_INIT_STATUS_MEM_STATUS" width="1" begin="0" end="0" resetval="0x0" description="1'b0: No initialization is happening for ATCM banks of CR5A/B1'b1: Initialization is in progress for ATCM banks of CR5A/B" range="0" rwaccess="R"/>
	</register><register id="MSS_CTRL_MSS_BTCM1_MEM_INIT" acronym="MSS_CTRL_MSS_BTCM1_MEM_INIT" offset="560" width="32" description="This register is used to initialise the data and ECC of BTCM memory of R5SS1.">
		<bitfield id="MSS_BTCM1_MEM_INIT_MEM_INIT" width="1" begin="0" end="0" resetval="0x0" description="Write_pulse bit field:Writing 1'b1 will start initializing the B0/1TCM banks of CR5A/B" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_BTCM1_MEM_INIT_DONE" acronym="MSS_CTRL_MSS_BTCM1_MEM_INIT_DONE" offset="564" width="32" description="This register is used to indicate the BTCM memory initialization completion for R5SS1.">
		<bitfield id="MSS_BTCM1_MEM_INIT_DONE_MEM_INIT_DONE" width="1" begin="0" end="0" resetval="0x0" description="This field will be high once initialization of B0/1TCM banks is finished. Writing '1' would clear the bit." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_BTCM1_MEM_INIT_STATUS" acronym="MSS_CTRL_MSS_BTCM1_MEM_INIT_STATUS" offset="568" width="32" description="This register is used to indicate the status of ongoing memory initialization for BTCM memory of R5SS1.">
		<bitfield id="MSS_BTCM1_MEM_INIT_STATUS_MEM_STATUS" width="1" begin="0" end="0" resetval="0x0" description="1'b0: No initialization is happening for B0/1TCM banks of CR5A/B1'b1: Initialization is in progress for B0/1TCM banks of CR5A/B" range="0" rwaccess="R"/>
	</register><register id="MSS_CTRL_MSS_L2_MEM_INIT" acronym="MSS_CTRL_MSS_L2_MEM_INIT" offset="576" width="32" description="This register is used to initialise the data and ECC of L2OCRAM.">
		<bitfield id="MSS_L2_MEM_INIT_PARTITION3" width="1" begin="3" end="3" resetval="0x0" description="Write_pulse bit field:Writing 1'b1 will start initializing the L2 Bank3. Value in each row is initialized to 0x0" range="3" rwaccess="R/W"/>
	<bitfield id="MSS_L2_MEM_INIT_PARTITION2" width="1" begin="2" end="2" resetval="0x0" description="Write_pulse bit field:Writing 1'b1 will start initializing the L2 Bank2. Value in each row is initialized to 0x0" range="2" rwaccess="R/W"/>
	<bitfield id="MSS_L2_MEM_INIT_PARTITION1" width="1" begin="1" end="1" resetval="0x0" description="Write_pulse bit field:Writing 1'b1 will start initializing the L2 Bank1. Value in each row is initialized to 0x0" range="1" rwaccess="R/W"/>
	<bitfield id="MSS_L2_MEM_INIT_PARTITION0" width="1" begin="0" end="0" resetval="0x0" description="Write_pulse bit field:Writing 1'b1 will start initializing the L2 Bank0. Value in each row is initialized to 0x0" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_L2_MEM_INIT_DONE" acronym="MSS_CTRL_MSS_L2_MEM_INIT_DONE" offset="580" width="32" description="This register is used to indicate the L2OCRAM memory initialization completion .">
		<bitfield id="MSS_L2_MEM_INIT_DONE_PARTITION3" width="1" begin="3" end="3" resetval="0x0" description="This field will be high once intialization of L2 bank3 is finished. Writing '1' would clear the bit" range="3" rwaccess="R/W"/>
	<bitfield id="MSS_L2_MEM_INIT_DONE_PARTITION2" width="1" begin="2" end="2" resetval="0x0" description="This field will be high once intialization of L2 bank2 is finished. Writing '1' would clear the bit" range="2" rwaccess="R/W"/>
	<bitfield id="MSS_L2_MEM_INIT_DONE_PARTITION1" width="1" begin="1" end="1" resetval="0x0" description="This field will be high once intialization of L2 bank1 is finished. Writing '1' would clear the bit" range="1" rwaccess="R/W"/>
	<bitfield id="MSS_L2_MEM_INIT_DONE_PARTITION0" width="1" begin="0" end="0" resetval="0x0" description="This field will be high once intialization of L2 bank0 is finished. Writing '1' would clear the bit" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_L2_MEM_INIT_STATUS" acronym="MSS_CTRL_MSS_L2_MEM_INIT_STATUS" offset="584" width="32" description="This register is used to indicate the status of ongoing memory initialization for L2OCRAM.">
		<bitfield id="MSS_L2_MEM_INIT_STATUS_PARTITION3" width="1" begin="3" end="3" resetval="0x0" description="1'b0: No initialization is happening for L2 bank31'b1: Initialization is in progress for L2 bank3" range="3" rwaccess="R"/>
	<bitfield id="MSS_L2_MEM_INIT_STATUS_PARTITION2" width="1" begin="2" end="2" resetval="0x0" description="1'b0: No initialization is happening for L2 bank2 1'b1: Initialization is in progress for L2 bank2" range="2" rwaccess="R"/>
	<bitfield id="MSS_L2_MEM_INIT_STATUS_PARTITION1" width="1" begin="1" end="1" resetval="0x0" description="1'b0: No initialization is happening for L2 bank11'b1: Initialization is in progress for L2 bank1" range="1" rwaccess="R"/>
	<bitfield id="MSS_L2_MEM_INIT_STATUS_PARTITION0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: No initialization is happening for L2 bank0 1'b1: Initialization is in progress for L2 bank0" range="0" rwaccess="R"/>
	</register><register id="MSS_CTRL_MSS_MAILBOX_MEM_INIT" acronym="MSS_CTRL_MSS_MAILBOX_MEM_INIT" offset="592" width="32" description="This register is used to initialise the data and ECC of MBOX_SRAM.">
		<bitfield id="MSS_MAILBOX_MEM_INIT_MEM0_INIT" width="1" begin="0" end="0" resetval="0x0" description="Write_pulse bit field:Writing 1'b1 will start initializing the MSS_MBOX. Value in each row is initialized to 0x0" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_MAILBOX_MEM_INIT_DONE" acronym="MSS_CTRL_MSS_MAILBOX_MEM_INIT_DONE" offset="596" width="32" description="This register is used to indicate the  MBOX_SRAM memory initialization completion .">
		<bitfield id="MSS_MAILBOX_MEM_INIT_DONE_MEM0_DONE" width="1" begin="0" end="0" resetval="0x0" description="This field will be high once intialization of MSS_MBOX is finished. Writing '1' would clear the bit" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_MAILBOX_MEM_INIT_STATUS" acronym="MSS_CTRL_MSS_MAILBOX_MEM_INIT_STATUS" offset="600" width="32" description="This register is used to indicate the status of ongoing memory initialization for MBOX_SRAM.">
		<bitfield id="MSS_MAILBOX_MEM_INIT_STATUS_MEM0_STATUS" width="1" begin="0" end="0" resetval="0x0" description="1'b0: No initialization is happening for MSS_MBOX 1'b1: Initialization is in progress for MSS_MBOX" range="0" rwaccess="R"/>
	</register><register id="MSS_CTRL_MSS_TPCC_MEMINIT_START" acronym="MSS_CTRL_MSS_TPCC_MEMINIT_START" offset="608" width="32" description="This register is used to initialise the data and ECC of EDMA_TPCC RAM.">
		<bitfield id="MSS_TPCC_MEMINIT_START_TPCC_A_MEMINIT_START" width="1" begin="0" end="0" resetval="0x0" description="Write_pulse bit field:Writing 1'b1 will start initializing the MSS_TPCCA" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_TPCC_MEMINIT_DONE" acronym="MSS_CTRL_MSS_TPCC_MEMINIT_DONE" offset="612" width="32" description="This register is used to indicate the  EDMA_TPCC  memory initialization completion .">
		<bitfield id="MSS_TPCC_MEMINIT_DONE_TPCC_A_MEMINIT_DONE" width="1" begin="0" end="0" resetval="0x0" description="This field will be high once intialization of MSS_TPCCA is finished. Writing '1' would clear the bit" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_TPCC_MEMINIT_STATUS" acronym="MSS_CTRL_MSS_TPCC_MEMINIT_STATUS" offset="616" width="32" description="This register is used to indicate the status of ongoing memory initialization for EDMA_TPCC RAM.">
		<bitfield id="MSS_TPCC_MEMINIT_STATUS_TPCC_A_MEMINIT_STATUS" width="1" begin="0" end="0" resetval="0x0" description="1'b0: No initialization is happening for MSS_TPCCA1'b1: Initialization is in progress for MSS_TPCCB" range="0" rwaccess="R"/>
	</register><register id="MSS_CTRL_TOP_PBIST_KEY_RST" acronym="MSS_CTRL_TOP_PBIST_KEY_RST" offset="768" width="32" description="This register is used to enable Top Pbist module.">
		<bitfield id="MSS_PBIST_KEY_RST_PBIST_ST_RST" width="4" begin="7" end="4" resetval="0x0" description="MSS PBIST controller will be brought out of reset when value is 0xA" range="7:4" rwaccess="R/W"/>
	<bitfield id="MSS_PBIST_KEY_RST_PBIST_ST_KEY" width="4" begin="3" end="0" resetval="0x0" description="Top PBIST Selftest Key. Valid value is 0x5" range="3:0" rwaccess="R/W"/>
