ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/MSS_CTRL_MSS_CTRL_50D00000h.xml
	</register><register id="MSS_CTRL_MSS_R5SS0_CTI_TRIG_SEL" acronym="MSS_CTRL_MSS_R5SS0_CTI_TRIG_SEL" offset="1024" width="32" description="This register is used to select the two CTI trigger sources for R5SS[x] ">
		<bitfield id="MSS_R5SS0_CTI_TRIG_SEL_TRIG1" width="8" begin="15" end="8" resetval="0x0" description="Used for selecting the trigger source for 1st trigger of MSS_R5SS" range="15:8" rwaccess="R/W"/>
	<bitfield id="MSS_R5SS0_CTI_TRIG_SEL_TRIG0" width="8" begin="7" end="0" resetval="0x0" description="Used for selecting the trigger source for 0th trigger of MSS_R5SS" range="7:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_R5SS1_CTI_TRIG_SEL" acronym="MSS_CTRL_MSS_R5SS1_CTI_TRIG_SEL" offset="1028" width="32" description="This register is used to select the two CTI trigger sources for R5SS[x] ">
		<bitfield id="MSS_R5SS1_CTI_TRIG_SEL_TRIG1" width="8" begin="15" end="8" resetval="0x0" description="Used for selecting the trigger source for 1st trigger of MSS_R5SS" range="15:8" rwaccess="R/W"/>
	<bitfield id="MSS_R5SS1_CTI_TRIG_SEL_TRIG0" width="8" begin="7" end="0" resetval="0x0" description="Used for selecting the trigger source for 0th trigger of MSS_R5SS" range="7:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_DBGSS_CTI_TRIG_SEL" acronym="MSS_CTRL_MSS_DBGSS_CTI_TRIG_SEL" offset="1032" width="32" description="This register is used to select thefour  CTI trigger sources for DEBUGSS.">
		<bitfield id="MSS_DBGSS_CTI_TRIG_SEL_TRIG3" width="8" begin="31" end="24" resetval="0x0" description="Used for selecting the trigger source for 3rd trigger  of ONE_MCU_CTI" range="31:24" rwaccess="R/W"/>
	<bitfield id="MSS_DBGSS_CTI_TRIG_SEL_TRIG2" width="8" begin="23" end="16" resetval="0x0" description="Used for selecting the trigger source for 2nd trigger of ONE_MCU_CTI" range="23:16" rwaccess="R/W"/>
	<bitfield id="MSS_DBGSS_CTI_TRIG_SEL_TRIG1" width="8" begin="15" end="8" resetval="0x0" description="Used for selecting the trigger source for 1st trigger  of ONE_MCU_CTI" range="15:8" rwaccess="R/W"/>
	<bitfield id="MSS_DBGSS_CTI_TRIG_SEL_TRIG0" width="8" begin="7" end="0" resetval="0x0" description="Used for selecting the trigger source for 0th trigger  of ONE_MCU_CTI" range="7:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MCAN0_HALTEN" acronym="MSS_CTRL_MCAN0_HALTEN" offset="1056" width="32" description="This register selects which R5 CPU when debug halted shall halt MCAN[x] Peripheral.">
		<bitfield id="CAN0_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CAN0_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CAN0_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CAN0_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MCAN1_HALTEN" acronym="MSS_CTRL_MCAN1_HALTEN" offset="1060" width="32" description="This register selects which R5 CPU when debug halted shall halt MCAN[x] Peripheral.">
		<bitfield id="CAN1_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CAN1_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CAN1_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CAN1_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MCAN2_HALTEN" acronym="MSS_CTRL_MCAN2_HALTEN" offset="1064" width="32" description="This register selects which R5 CPU when debug halted shall halt MCAN[x] Peripheral.">
		<bitfield id="CAN2_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CAN2_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CAN2_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CAN2_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MCAN3_HALTEN" acronym="MSS_CTRL_MCAN3_HALTEN" offset="1068" width="32" description="This register selects which R5 CPU when debug halted shall halt MCAN[x] Peripheral.">
		<bitfield id="CAN3_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CAN3_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CAN3_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CAN3_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_LIN0_HALTEN" acronym="MSS_CTRL_LIN0_HALTEN" offset="1072" width="32" description="This register selects which R5 CPU when debug halted shall halt LIN[x] Peripheral.">
		<bitfield id="LIN0_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="LIN0_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="LIN0_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="LIN0_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_LIN1_HALTEN" acronym="MSS_CTRL_LIN1_HALTEN" offset="1076" width="32" description="This register selects which R5 CPU when debug halted shall halt LIN[x] Peripheral.">
		<bitfield id="LIN1_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="LIN1_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="LIN1_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="LIN1_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_LIN2_HALTEN" acronym="MSS_CTRL_LIN2_HALTEN" offset="1080" width="32" description="This register selects which R5 CPU when debug halted shall halt LIN[x] Peripheral.">
		<bitfield id="LIN2_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="LIN2_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="LIN2_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="LIN2_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_LIN3_HALTEN" acronym="MSS_CTRL_LIN3_HALTEN" offset="1084" width="32" description="This register selects which R5 CPU when debug halted shall halt LIN[x] Peripheral.">
		<bitfield id="LIN3_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="LIN3_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="LIN3_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="LIN3_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_LIN4_HALTEN" acronym="MSS_CTRL_LIN4_HALTEN" offset="1088" width="32" description="This register selects which R5 CPU when debug halted shall halt LIN[x] Peripheral.">
		<bitfield id="LIN4_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="LIN4_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="LIN4_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="LIN4_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_I2C0_HALTEN" acronym="MSS_CTRL_I2C0_HALTEN" offset="1092" width="32" description="This register selects which R5 CPU when debug halted shall halt I2C[x] Peripheral.">
		<bitfield id="I2C0_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="I2C0_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="I2C0_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="I2C0_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_I2C1_HALTEN" acronym="MSS_CTRL_I2C1_HALTEN" offset="1096" width="32" description="This register selects which R5 CPU when debug halted shall halt I2C[x] Peripheral.">
		<bitfield id="I2C1_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="I2C1_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="I2C1_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="I2C1_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_I2C2_HALTEN" acronym="MSS_CTRL_I2C2_HALTEN" offset="1100" width="32" description="This register selects which R5 CPU when debug halted shall halt I2C[x] Peripheral.">
		<bitfield id="I2C2_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="I2C2_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="I2C2_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="I2C2_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_I2C3_HALTEN" acronym="MSS_CTRL_I2C3_HALTEN" offset="1104" width="32" description="This register selects which R5 CPU when debug halted shall halt I2C[x] Peripheral.">
		<bitfield id="I2C3_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="I2C3_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="I2C3_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="I2C3_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_RTI0_HALTEN" acronym="MSS_CTRL_RTI0_HALTEN" offset="1108" width="32" description="This register selects which R5 CPU when debug halted shall halt RTI[x] Peripheral.">
		<bitfield id="RTI0_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="RTI0_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="RTI0_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="RTI0_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_RTI1_HALTEN" acronym="MSS_CTRL_RTI1_HALTEN" offset="1112" width="32" description="This register selects which R5 CPU when debug halted shall halt RTI[x] Peripheral.">
		<bitfield id="RTI1_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="RTI1_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="RTI1_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="RTI1_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_RTI2_HALTEN" acronym="MSS_CTRL_RTI2_HALTEN" offset="1116" width="32" description="This register selects which R5 CPU when debug halted shall halt RTI[x] Peripheral.">
		<bitfield id="RTI2_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="RTI2_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="RTI2_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="RTI2_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_RTI3_HALTEN" acronym="MSS_CTRL_RTI3_HALTEN" offset="1120" width="32" description="This register selects which R5 CPU when debug halted shall halt RTI[x] Peripheral.">
		<bitfield id="RTI3_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="RTI3_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="RTI3_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="RTI3_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_CPSW_HALTEN" acronym="MSS_CTRL_CPSW_HALTEN" offset="1140" width="32" description="This register selects which R5 CPU when debug halted shall halt CPSW Peripheral.">
		<bitfield id="CPSW_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CPSW_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CPSW_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CPSW_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_CRC_HALTEN" acronym="MSS_CTRL_CRC_HALTEN" offset="1144" width="32" description="This register selects which R5 CPU when debug halted shall halt MCRC Peripheral.">
		<bitfield id="CRC_HALTEN_CR5B1_HALTEN" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CRC_HALTEN_CR5A1_HALTEN" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CRC_HALTEN_CR5B0_HALTEN" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CRC_HALTEN_CR5A0_HALTEN" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_TPTC_DBS_CONFIG" acronym="MSS_CTRL_TPTC_DBS_CONFIG" offset="2048" width="32" description="This register controls the default burst size of EDMA TPTC.">
		<bitfield id="TPTC_DBS_CONFIG_TPTC_A1" width="2" begin="5" end="4" resetval="0x0" description="DBS [default burst size] tieoff value for TPTC A1. DBS tieoff defines optimally sized cmd.Both the read and write controller will always issue commands that are less than or equal to the DBS tieoff value. This will typically be on the order of 4 or 8 dataphases worth of data. DBS must always be tied off to no larger than half of the Channel FIFO size. Set DBS to -2'b00 = 16 byte 2'b01 = 32 byte 2'b10 = 64 byte 2'b11 = 128 byte" range="5:4" rwaccess="R/W"/>
