ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/MSS_CTRL_MSS_CTRL_50D00000h.xml
	<bitfield id="TPTC_DBS_CONFIG_TPTC_A0" width="2" begin="1" end="0" resetval="0x0" description="DBS [default burst size] tieoff value for TPTC A0. DBS tieoff defines optimally sized cmd.Both the read and write controller will always issue commands that are less than or equal to the DBS tieoff value. This will typically be on the order of 4 or 8 dataphases worth of data. DBS must always be tied off to no larger than half of the Channel FIFO size. Set DBS to -2'b00 = 16 byte 2'b01 = 32 byte 2'b10 = 64 byte 2'b11 = 128 byte" range="1:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_TPTC_BOUNDARY_CFG" acronym="MSS_CTRL_MSS_TPTC_BOUNDARY_CFG" offset="2052" width="32" description="The register is used to control TPTC boundary configuration.">
		<bitfield id="MSS_TPTC_BOUNDARY_CFG_TPTC_A1_SIZE" width="6" begin="13" end="8" resetval="0x19" description="6 bit signal used for deciding the boundary crossing size for CID-RID-SID reordering of MSS_TPTC_A1Example: Writing 6'd19 decidies boundary to be 2^19  i.e. 512 KB" range="13:8" rwaccess="R/W"/>
	<bitfield id="MSS_TPTC_BOUNDARY_CFG_TPTC_A0_SIZE" width="6" begin="5" end="0" resetval="0x19" description="6 bit signal used for deciding the boundary crossing size for CID-RID-SID reordering of MSS_TPTC_A0Example: Writing 6'd19 decidies boundary to be 2^19  i.e. 512 KB" range="5:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_TPTC_XID_REORDER_CFG" acronym="MSS_CTRL_MSS_TPTC_XID_REORDER_CFG" offset="2056" width="32" description="The register is used to control TPTC XID reorder configuration.">
		<bitfield id="MSS_TPTC_XID_REORDER_CFG_TPTC_A1_DISABLE" width="1" begin="8" end="8" resetval="0x0" description="Writing 1'b1 will disable the CID-RID-SID reodering feature for MSS_TPTC_A1" range="8" rwaccess="R/W"/>
	<bitfield id="MSS_TPTC_XID_REORDER_CFG_TPTC_A0_DISABLE" width="1" begin="0" end="0" resetval="0x0" description="Writing 1'b1 will disable the CID-RID-SID reodering feature for MSS_TPTC_A0" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_CPSW_CONTROL" acronym="MSS_CTRL_CPSW_CONTROL" offset="2064" width="32" description="Ther register is for the CPSW Ethernet modes and additional controls on the.">
		<bitfield id="CPSW_CONTROL_RGMII2_ID_MODE" width="1" begin="24" end="24" resetval="0x1" description="Internal delay mode for port 2. Only for TX1'b0 ID mode is disabled1'b1 ID mode is enabled" range="24" rwaccess="R/W"/>
	<bitfield id="CPSW_CONTROL_RMII2_REF_CLK_SEL" width="1" begin="22" end="22" resetval="0x0" description="To select the rmii_ref_clk loopback mux output either from PAD or from MSS_RCM.   Write 1'b0 to get clock will be from IO pad[pad loopback]. Write 1'b1 to get clock from internal loopback." range="22" rwaccess="R/W"/>
	<bitfield id="CPSW_CONTROL_RMII2_REF_CLK_OE_N" width="1" begin="20" end="20" resetval="0x0" description="RMII_REF_CLK IO Output enable control1'b0: Output enable1'b1: Output Disable" range="20" rwaccess="R/W"/>
	<bitfield id="CPSW_CONTROL_PORT2_MODE_SEL" width="3" begin="18" end="16" resetval="0x0" description="Port 2 Interface 3'b000 = MII3'b001 = RMII3'b010 = RGMII011 - 111 = Not Supported" range="18:16" rwaccess="R/W"/>
	<bitfield id="CPSW_CONTROL_RGMII1_ID_MODE" width="1" begin="8" end="8" resetval="0x1" description="Internal delay mode for port 1. Only for TX1'b0 ID mode is disabled1'b1 ID mode is enabled" range="8" rwaccess="R/W"/>
	<bitfield id="CPSW_CONTROL_RMII1_REF_CLK_SEL" width="1" begin="6" end="6" resetval="0x0" description="To select the rmii_ref_clk loopback mux output either from PAD or from MSS_RCM.   Write 1'b0 to get clock will be from IO pad[pad loopback]. Write 1'b1 to get clock from internal source" range="6" rwaccess="R/W"/>
	<bitfield id="CPSW_CONTROL_RMII1_REF_CLK_OE_N" width="1" begin="4" end="4" resetval="0x0" description="RMII_REF_CLK IO Output enable control1'b0: Output enable1'b1: Output Disable" range="4" rwaccess="R/W"/>
	<bitfield id="CPSW_CONTROL_PORT1_MODE_SEL" width="3" begin="2" end="0" resetval="0x0" description="Port 1 Interface 3'b000 = MII3'b001 = RMII3'b010 = RGMII011 - 111 = Not Supported" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_GLOBAL_CONTROLS" acronym="MSS_CTRL_GLOBAL_CONTROLS" offset="2072" width="32" description="Internal Only.">
		<bitfield id="GLOBAL_CONTROLS_NOGATE" width="1" begin="0" end="0" resetval="0x1" description="Writing 1'b0 will enable local auto-clock gating [lower power] at IP level with increase in access/functional latency. Following IPs are controlled with this signalICSSM" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_PRU_ICSS_PRU0_GPI_SEL" acronym="MSS_CTRL_PRU_ICSS_PRU0_GPI_SEL" offset="2076" width="32" description="Selects Chip input or Control peripheral for ICSSM PRU0 GPI source.">
		<bitfield id="PRU_ICSS_PRU0_GPI_SEL_SEL" width="30" begin="29" end="0" resetval="0x0" description="GPI or PWMXBAR select for ICSM Port01'b0 GPI1'b1 PWMXBAR" range="29:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_PRU_ICSS_PRU1_GPI_SEL" acronym="MSS_CTRL_PRU_ICSS_PRU1_GPI_SEL" offset="2080" width="32" description="Selects Chip input or Control peripheral for ICSSM PRU1 GPI source.">
		<bitfield id="PRU_ICSS_PRU1_GPI_SEL_SEL" width="30" begin="29" end="0" resetval="0x0" description="GPI or PWMXBAR select for ICSM Port01'b0 GPI1'b1 PWMXBAR" range="29:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_PRU_ICSS_PRU0_GPIO_OUT_CTRL" acronym="MSS_CTRL_PRU_ICSS_PRU0_GPIO_OUT_CTRL" offset="2084" width="32" description="Controls the Output enable of the ICSSM PRU0  GPIO pins.">
		<bitfield id="PRU_ICSS_PRU0_GPIO_OUT_CTRL_OUTDISABLE" width="30" begin="29" end="0" resetval="0x0" description="GPO output disable for ICSSM Port 0 IO. Disable output for using the pin  as input. Each Bit maps to the corresponding bit in the IO1'b0 Output Enable1'b1 Output Disable" range="29:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_PRU_ICSS_PRU1_GPIO_OUT_CTRL" acronym="MSS_CTRL_PRU_ICSS_PRU1_GPIO_OUT_CTRL" offset="2088" width="32" description="Controls the Output enable of the ICSSM PRU1  GPIO pins.">
		<bitfield id="PRU_ICSS_PRU1_GPIO_OUT_CTRL_OUTDISABLE" width="30" begin="29" end="0" resetval="0x0" description="GPO output disable for ICSSM Port 1 IO. Disable output for using the pin  as input. Each Bit maps to the corresponding bit in the IO1'b0 Output Enable1'b1 Output Disable" range="29:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_GPMC_CONTROL" acronym="MSS_CTRL_GPMC_CONTROL" offset="2092" width="32" description="This register is used to configure the GPMC Clock source and Loop Back clock Source.">
		<bitfield id="GPMC_CONTROL_CLK_LB_OE_N" width="1" begin="12" end="12" resetval="0x0" description="GPMC_CLK_LB oe_n1'b1 GPMC_dev_clk is driven to pad1'b0 GPMC_dev_clk is not driven to pad" range="12" rwaccess="R/W"/>
	<bitfield id="GPMC_CONTROL_CLK_OE_N" width="1" begin="8" end="8" resetval="0x1" description="GPMC_CLKOUT oe_n1'b1 GPMC_dev_clk mux output is driven to pad1'b0 GPMC_dev_clk mux output is not driven to pad" range="8" rwaccess="R/W"/>
	<bitfield id="GPMC_CONTROL_CLK_LB_SEL" width="1" begin="4" end="4" resetval="0x0" description="GPMC_CLK_LB sel1'b0 GPMC_CLK_LB pad clock1'b1 GPMC_CLK pad clock" range="4" rwaccess="R/W"/>
	<bitfield id="GPMC_CONTROL_CLKOUT_SEL" width="1" begin="0" end="0" resetval="0x0" description="GPMC_CLKOUT sel1'b0 GPMC_func_clock1'b1 GPMC_dev clock" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_TPCC_A_INTAGG_MASK" acronym="MSS_CTRL_MSS_TPCC_A_INTAGG_MASK" offset="2096" width="32" description="This register Masks selected interrupt soures  from the Aggregated TPCC0 interrupt.">
		<bitfield id="MSS_TPCC_A_INTAGG_MASK_TPTC_A1" width="1" begin="17" end="17" resetval="0x0" description="Mask Interrupt from TPTC A1 to aggregated Interrupt MSS_TPCC_A_INTAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="17" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_MASK_TPTC_A0" width="1" begin="16" end="16" resetval="0x0" description="Mask Interrupt from TPTC A0 to aggregated Interrupt MSS_TPCC_A_INTAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="16" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_MASK_TPCC_A_INT7" width="1" begin="8" end="8" resetval="0x0" description="Mask Interrupt from MSS_TPCC_A to aggregated Interrupt MSS_TPCC_A_INTAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="8" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_MASK_TPCC_A_INT6" width="1" begin="7" end="7" resetval="0x0" description="Mask Interrupt from MSS_TPCC_A to aggregated Interrupt MSS_TPCC_A_INTAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="7" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_MASK_TPCC_A_INT5" width="1" begin="6" end="6" resetval="0x0" description="Mask Interrupt from MSS_TPCC_A to aggregated Interrupt MSS_TPCC_A_INTAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="6" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_MASK_TPCC_A_INT4" width="1" begin="5" end="5" resetval="0x0" description="Mask Interrupt from MSS_TPCC_A to aggregated Interrupt MSS_TPCC_A_INTAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="5" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_MASK_TPCC_A_INT3" width="1" begin="4" end="4" resetval="0x0" description="Mask Interrupt from MSS_TPCC_A to aggregated Interrupt MSS_TPCC_A_INTAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="4" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_MASK_TPCC_A_INT2" width="1" begin="3" end="3" resetval="0x0" description="Mask Interrupt from MSS_TPCC_A to aggregated Interrupt MSS_TPCC_A_INTAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="3" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_MASK_TPCC_A_INT1" width="1" begin="2" end="2" resetval="0x0" description="Mask Interrupt from MSS_TPCC_A to aggregated Interrupt MSS_TPCC_A_INTAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="2" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_MASK_TPCC_A_INT0" width="1" begin="1" end="1" resetval="0x0" description="Mask Interrupt from TPCC A to aggregated Interrupt MSS_TPCC_A_INTAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="1" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_MASK_TPCC_A_INTG" width="1" begin="0" end="0" resetval="0x0" description="Mask Interrupt from MSS_TPCC_A to aggregated Interrupt MSS_TPCC_A_INTAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_TPCC_A_INTAGG_STATUS" acronym="MSS_CTRL_MSS_TPCC_A_INTAGG_STATUS" offset="2100" width="32" description="This register shows the Status of Unmasked Interrupts from TPCC0.">
		<bitfield id="MSS_TPCC_A_INTAGG_STATUS_TPTC_A1" width="1" begin="17" end="17" resetval="0x0" description="Status of Interrupt from TPTC A1. Set only if Interupt is unmasked in MSS_TPCC_A_INTAGG_MASKWrie 0x1 to clear this interrupt." range="17" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_STATUS_TPTC_A0" width="1" begin="16" end="16" resetval="0x0" description="Status of Interrupt from TPTC A0. Set only if Interupt is unmasked in MSS_TPCC_A_INTAGG_MASKWrie 0x1 to clear this interrupt." range="16" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_STATUS_TPCC_A_INT7" width="1" begin="8" end="8" resetval="0x0" description="Status of Interrupt from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_INTAGG_MASKWrie 0x1 to clear this interrupt." range="8" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_STATUS_TPCC_A_INT6" width="1" begin="7" end="7" resetval="0x0" description="Status of Interrupt from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_INTAGG_MASKWrie 0x1 to clear this interrupt." range="7" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_STATUS_TPCC_A_INT5" width="1" begin="6" end="6" resetval="0x0" description="Status of Interrupt from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_INTAGG_MASKWrie 0x1 to clear this interrupt." range="6" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_STATUS_TPCC_A_INT4" width="1" begin="5" end="5" resetval="0x0" description="Status of Interrupt from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_INTAGG_MASKWrie 0x1 to clear this interrupt." range="5" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_STATUS_TPCC_A_INT3" width="1" begin="4" end="4" resetval="0x0" description="Status of Interrupt from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_INTAGG_MASKWrie 0x1 to clear this interrupt." range="4" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_STATUS_TPCC_A_INT2" width="1" begin="3" end="3" resetval="0x0" description="Status of Interrupt from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_INTAGG_MASKWrie 0x1 to clear this interrupt." range="3" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_STATUS_TPCC_A_INT1" width="1" begin="2" end="2" resetval="0x0" description="Status of Interrupt from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_INTAGG_MASKWrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_STATUS_TPCC_A_INT0" width="1" begin="1" end="1" resetval="0x0" description="Status of Interrupt from TPCC A Set only if Interupt is unmasked in MSS_TPCC_A_INTAGG_MASKWrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_STATUS_TPCC_A_INTG" width="1" begin="0" end="0" resetval="0x0" description="Status of Interrupt from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_INTAGG_MASKWrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_TPCC_A_INTAGG_STATUS_RAW" acronym="MSS_CTRL_MSS_TPCC_A_INTAGG_STATUS_RAW" offset="2104" width="32" description="This register shows the Status of all  Interrupts from TPCC0.">
		<bitfield id="MSS_TPCC_A_INTAGG_STATUS_RAW_TPTC_A1" width="1" begin="17" end="17" resetval="0x0" description="Raw Status of Interrupt from TPTC A1. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_INTAGG_MASK" range="17" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_STATUS_RAW_TPTC_A0" width="1" begin="16" end="16" resetval="0x0" description="Raw Status of Interrupt from TPTC A0. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_INTAGG_MASK" range="16" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_STATUS_RAW_TPCC_A_INT7" width="1" begin="8" end="8" resetval="0x0" description="Raw Status of Interrupt from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_C_INTAGG_MASK" range="8" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_STATUS_RAW_TPCC_A_INT6" width="1" begin="7" end="7" resetval="0x0" description="Raw Status of Interrupt from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_C_INTAGG_MASK" range="7" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_STATUS_RAW_TPCC_A_INT5" width="1" begin="6" end="6" resetval="0x0" description="Raw Status of Interrupt from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_C_INTAGG_MASK" range="6" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_STATUS_RAW_TPCC_A_INT4" width="1" begin="5" end="5" resetval="0x0" description="Raw Status of Interrupt from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_C_INTAGG_MASK" range="5" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_STATUS_RAW_TPCC_A_INT3" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Interrupt from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_C_INTAGG_MASK" range="4" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_STATUS_RAW_TPCC_A_INT2" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Interrupt from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_C_INTAGG_MASK" range="3" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_STATUS_RAW_TPCC_A_INT1" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Interrupt from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_C_INTAGG_MASK" range="2" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_STATUS_RAW_TPCC_A_INT0" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Interrupt from TPCC A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_INTAGG_MASK" range="1" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_INTAGG_STATUS_RAW_TPCC_A_INTG" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Interrupt from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_C_INTAGG_MASK" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_LOCK0_KICK0" acronym="MSS_CTRL_LOCK0_KICK0" offset="4104" width="32" description=" - KICK0 component.">
		<bitfield id="LOCK0_KICK0" width="32" begin="31" end="0" resetval="0x0" description=" - KICK0 component" range="31:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_LOCK0_KICK1" acronym="MSS_CTRL_LOCK0_KICK1" offset="4108" width="32" description=" - KICK1 component.">
		<bitfield id="LOCK0_KICK1" width="32" begin="31" end="0" resetval="0x0" description=" - KICK1 component" range="31:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_INTR_RAW_STATUS" acronym="MSS_CTRL_INTR_RAW_STATUS" offset="4112" width="32" description="Interrupt Raw Status/Set Register.">
		<bitfield id="PROXY_ERR" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="3" rwaccess="R/W1TS"/>
	<bitfield id="KICK_ERR" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="2" rwaccess="R/W1TS"/>
	<bitfield id="ADDR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="1" rwaccess="R/W1TS"/>
	<bitfield id="PROT_ERR" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="0" rwaccess="R/W1TS"/>
	</register><register id="MSS_CTRL_INTR_ENABLED_STATUS_CLEAR" acronym="MSS_CTRL_INTR_ENABLED_STATUS_CLEAR" offset="4116" width="32" description="Interrupt Enabled Status/Clear register.">
		<bitfield id="ENABLED_PROXY_ERR" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="3" rwaccess="R/W1TC"/>
	<bitfield id="ENABLED_KICK_ERR" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="2" rwaccess="R/W1TC"/>
	<bitfield id="ENABLED_ADDR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="1" rwaccess="R/W1TC"/>
	<bitfield id="ENABLED_PROT_ERR" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="0" rwaccess="R/W1TC"/>
	</register><register id="MSS_CTRL_INTR_ENABLE" acronym="MSS_CTRL_INTR_ENABLE" offset="4120" width="32" description="Interrupt Enable register.">
		<bitfield id="PROXY_ERR_EN" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="3" rwaccess="R/W1TS"/>
	<bitfield id="KICK_ERR_EN" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="2" rwaccess="R/W1TS"/>
	<bitfield id="ADDR_ERR_EN" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="1" rwaccess="R/W1TS"/>
	<bitfield id="PROT_ERR_EN" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="0" rwaccess="R/W1TS"/>
	</register><register id="MSS_CTRL_INTR_ENABLE_CLEAR" acronym="MSS_CTRL_INTR_ENABLE_CLEAR" offset="4124" width="32" description="Interrupt Enable Clear register.">
		<bitfield id="PROXY_ERR_EN_CLR" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error enable clear. Write a 1 to clear the enable. Writing a 0 has no effect." range="3" rwaccess="R/W1TC"/>
	<bitfield id="KICK_ERR_EN_CLR" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error enable clear. Write a 1 to clear the enable. Writing a 0 has no effect." range="2" rwaccess="R/W1TC"/>
	<bitfield id="ADDR_ERR_EN_CLR" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error enable clear. Write a 1 to clear the enable. Writing a 0 has no effect." range="1" rwaccess="R/W1TC"/>
	<bitfield id="PROT_ERR_EN_CLR" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error enable clear. Write a 1 to clear the enable. Writing a 0 has no effect." range="0" rwaccess="R/W1TC"/>
	</register><register id="MSS_CTRL_EOI" acronym="MSS_CTRL_EOI" offset="4128" width="32" description="EOI register.">
		<bitfield id="EOI_VECTOR" width="8" begin="7" end="0" resetval="0x0" description="EOI vector value. Write this with interrupt distribution value in the chip." range="7:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_FAULT_ADDRESS" acronym="MSS_CTRL_FAULT_ADDRESS" offset="4132" width="32" description="Fault Address register.">
		<bitfield id="FAULT_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Fault Address." range="31:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_FAULT_TYPE_STATUS" acronym="MSS_CTRL_FAULT_TYPE_STATUS" offset="4136" width="32" description="Fault Type Status register.">
		<bitfield id="FAULT_NS" width="1" begin="6" end="6" resetval="0x0" description="Non-secure access." range="6" rwaccess="R"/>
	<bitfield id="FAULT_TYPE" width="6" begin="5" end="0" resetval="0x0" description="Fault Type  10_0000 = Supervisor read  fault  - priv = 1 dir = 1 dtype != 1   01_0000 = Supervisor write fault  - priv = 1 dir = 0  00_1000 = Supervisor execute fault - priv = 1 dir = 1 dtype = 1  00_0100 = User read  fault - priv = 0 dir = 1 dtype = 1  00_0010 = User write fault - priv = 0 dir = 0  00_0001 = User execute fault - priv = 0 dir = 1 dtype = 1  00_0000 = No fault" range="5:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_FAULT_ATTR_STATUS" acronym="MSS_CTRL_FAULT_ATTR_STATUS" offset="4140" width="32" description="Fault Attribute Status register.">
		<bitfield id="FAULT_XID" width="12" begin="31" end="20" resetval="0x0" description="XID." range="31:20" rwaccess="R"/>
	<bitfield id="FAULT_ROUTEID" width="12" begin="19" end="8" resetval="0x0" description="Route ID." range="19:8" rwaccess="R"/>
	<bitfield id="FAULT_PRIVID" width="8" begin="7" end="0" resetval="0x0" description="Privilege ID." range="7:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_FAULT_CLEAR" acronym="MSS_CTRL_FAULT_CLEAR" offset="4144" width="32" description="Fault Clear register.">
		<bitfield id="FAULT_CLR" width="1" begin="0" end="0" resetval="0x0" description="Fault clear. Writing a 1 clears the current fault. Writing a 0 has no effect." range="0" rwaccess="W"/>
	</register><register id="MSS_CTRL_MSS_R5SS0_CORE0_MBOX_WRITE_DONE" acronym="MSS_CTRL_MSS_R5SS0_CORE0_MBOX_WRITE_DONE" offset="16384" width="32" description="This register is used by R5SS0 Core 0 to generate Mailbox interrupt to Recipent CPU.">
