ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/MSS_CTRL_MSS_CTRL_50D00000h.xml
		<bitfield id="MSS_CR5A0_MBOX_WRITE_DONE_PROC_7" width="1" begin="28" end="28" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 7" range="28" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A0_MBOX_WRITE_DONE_PROC_6" width="1" begin="24" end="24" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 6" range="24" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A0_MBOX_WRITE_DONE_PROC_5" width="1" begin="20" end="20" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 5" range="20" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A0_MBOX_WRITE_DONE_PROC_4" width="1" begin="16" end="16" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 4" range="16" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A0_MBOX_WRITE_DONE_PROC_3" width="1" begin="12" end="12" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 3" range="12" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A0_MBOX_WRITE_DONE_PROC_2" width="1" begin="8" end="8" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 2" range="8" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A0_MBOX_WRITE_DONE_PROC_1" width="1" begin="4" end="4" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 1" range="4" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A0_MBOX_WRITE_DONE_PROC_0" width="1" begin="0" end="0" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 0" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_R5SS0_CORE0_MBOX_READ_REQ" acronym="MSS_CTRL_MSS_R5SS0_CORE0_MBOX_READ_REQ" offset="16388" width="32" description="This register is used by R5SS0 Core 0 to know the Sender of Mailbox Interrupt as well as clear it.">
		<bitfield id="MSS_CR5A0_MBOX_READ_REQ_PROC_7" width="1" begin="28" end="28" resetval="0x0" description="This is request from  processor 7 to mss_cr5a. Requesting it to read from mailbox." range="28" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A0_MBOX_READ_REQ_PROC_6" width="1" begin="24" end="24" resetval="0x0" description="This is request from  processor 6 to mss_cr5a. Requesting it to read from mailbox." range="24" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A0_MBOX_READ_REQ_PROC_5" width="1" begin="20" end="20" resetval="0x0" description="This is request from  processor 5 to mss_cr5a. Requesting it to read from mailbox." range="20" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A0_MBOX_READ_REQ_PROC_4" width="1" begin="16" end="16" resetval="0x0" description="This is request from  processor 4 to mss_cr5a. Requesting it to read from mailbox." range="16" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A0_MBOX_READ_REQ_PROC_3" width="1" begin="12" end="12" resetval="0x0" description="This is request from  processor 3 to mss_cr5a. Requesting it to read from mailbox." range="12" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A0_MBOX_READ_REQ_PROC_2" width="1" begin="8" end="8" resetval="0x0" description="This is request from  processor 2 to mss_cr5a. Requesting it to read from mailbox." range="8" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A0_MBOX_READ_REQ_PROC_1" width="1" begin="4" end="4" resetval="0x0" description="This is request from  processor 1 to mss_cr5a. Requesting it to read from mailbox." range="4" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A0_MBOX_READ_REQ_PROC_0" width="1" begin="0" end="0" resetval="0x0" description="This is request from  processor 0 to mss_cr5a. Requesting it to read from mailbox." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_R5SS0_CORE0_MBOX_READ_DONE_ACK" acronym="MSS_CTRL_MSS_R5SS0_CORE0_MBOX_READ_DONE_ACK" offset="16392" width="32" description="This register is used by R5SS0 Core 0 to generate Mailbox Read acknowledgement to the Sender CPU.">
		<bitfield id="MSS_CR5A0_MBOX_READ_DONE_ACK_PROC" width="8" begin="7" end="0" resetval="0x0" description="Write pulse bit field:For bits 0 to7:Wrting1'b1 : Generates pulse interrupt to corresponding proc from MSS_CR5" range="7:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_R5SS0_CORE0_MBOX_READ_DONE" acronym="MSS_CTRL_MSS_R5SS0_CORE0_MBOX_READ_DONE" offset="16396" width="32" description="This register is used by R5SS0 Core 0 to know that the Receiver CPU has read the Mailbox and Acked. It is also used to clear the Read Done Interrupt.">
		<bitfield id="MSS_CR5A0_MBOX_READ_DONE_PROC_7" width="1" begin="28" end="28" resetval="0x0" description="This register should be written once finishing Reading from proc7's mailbox written by CR5A" range="28" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A0_MBOX_READ_DONE_PROC_6" width="1" begin="24" end="24" resetval="0x0" description="This register should be written once finishing Reading from proc6's mailbox written by CR5A" range="24" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A0_MBOX_READ_DONE_PROC_5" width="1" begin="20" end="20" resetval="0x0" description="This register should be written once finishing Reading from proc5's mailbox written by CR5A" range="20" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A0_MBOX_READ_DONE_PROC_4" width="1" begin="16" end="16" resetval="0x0" description="This register should be written once finishing Reading from proc4's mailbox written by CR5A" range="16" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A0_MBOX_READ_DONE_PROC_3" width="1" begin="12" end="12" resetval="0x0" description="This register should be written once finishing Reading from proc3's mailbox written by CR5A" range="12" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A0_MBOX_READ_DONE_PROC_2" width="1" begin="8" end="8" resetval="0x0" description="This register should be written once finishing Reading from proc2's mailbox written by CR5A" range="8" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A0_MBOX_READ_DONE_PROC_1" width="1" begin="4" end="4" resetval="0x0" description="This register should be written once finishing Reading from proc1's mailbox written by CR5A" range="4" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A0_MBOX_READ_DONE_PROC_0" width="1" begin="0" end="0" resetval="0x0" description="This register should be written once finishing Reading from proc0's mailbox written by CR5A" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_SW_INT_R5SS0_CORE0" acronym="MSS_CTRL_MSS_SW_INT_R5SS0_CORE0" offset="16400" width="32" description="This Register is used to generate a S/W Triggered Interrupt to R5SS0 Core0.">
		<bitfield id="MSS_SW_INT_R5SS0_CORE0_PULSE" width="1" begin="0" end="0" resetval="0x0" description="Write_pulse bit field:Writing 1'b1 to each bit will trigger MSS_SW_INT respectively to corresponding R5SS core" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MPU_ADDR_INTR_ERRAGG0_MASK" acronym="MSS_CTRL_MPU_ADDR_INTR_ERRAGG0_MASK" offset="16416" width="32" description="This register Masks selected interrupt soures from generating MPU Address Error Interrupt to R5SS0 CORE0 .">
		<bitfield id="MPU_ADDR_INTR_ERRAGG0_MASK_MPU_HSM_ADDR_ERR0" width="1" begin="17" end="17" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="17" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_MASK_MPU_CR5B1_AHB_ADDR_ERR0" width="1" begin="16" end="16" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="16" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_MASK_MPU_CR5A1_AHB_ADDR_ERR0" width="1" begin="15" end="15" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="15" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_MASK_MPU_CR5B0_AHB_ADDR_ERR0" width="1" begin="14" end="14" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="14" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_MASK_MPU_CR5A0_AHB_ADDR_ERR0" width="1" begin="13" end="13" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="13" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_MASK_MPU_SCRM2SCRP1_ADDR_ERR0" width="1" begin="12" end="12" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="12" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_MASK_MPU_SCRM2SCRP0_ADDR_ERR0" width="1" begin="11" end="11" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="11" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_MASK_MPU_QSPI_ADDR_ERR0" width="1" begin="10" end="10" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="10" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_MASK_MPU_MBOX_ADDR_ERR0" width="1" begin="9" end="9" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="9" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_MASK_MPU_DTHE_A_ADDR_ERR0" width="1" begin="8" end="8" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="8" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_MASK_MPU_CR5B1_AXIS_ADDR_ERR0" width="1" begin="7" end="7" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="7" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_MASK_MPU_CR5A1_AXIS_ADDR_ERR0" width="1" begin="6" end="6" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="6" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_MASK_MPU_CR5B0_AXIS_ADDR_ERR0" width="1" begin="5" end="5" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="5" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_MASK_MPU_CR5A0_AXIS_ADDR_ERR0" width="1" begin="4" end="4" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="4" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_MASK_MPU_L2_BANK_D_ADDR_ERR0" width="1" begin="3" end="3" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="3" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_MASK_MPU_L2_BANK_C_ADDR_ERR0" width="1" begin="2" end="2" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="2" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_MASK_MPU_L2_BANK_B_ADDR_ERR0" width="1" begin="1" end="1" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="1" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_MASK_MPU_L2_BANK_A_ADDR_ERR0" width="1" begin="0" end="0" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MPU_ADDR_INTR_ERRAGG0_STATUS" acronym="MSS_CTRL_MPU_ADDR_INTR_ERRAGG0_STATUS" offset="16420" width="32" description="This register shows the Status of Unmasked MPU Address Errors to R5SS0 Core0 .">
		<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_MPU_HSM_ADDR_ERR0" width="1" begin="17" end="17" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="17" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_MPU_CR5B1_AHB_ADDR_ERR0" width="1" begin="16" end="16" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="16" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_MPU_CR5A1_AHB_ADDR_ERR0" width="1" begin="15" end="15" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="15" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_MPU_CR5B0_AHB_ADDR_ERR0" width="1" begin="14" end="14" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="14" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_MPU_CR5A0_AHB_ADDR_ERR0" width="1" begin="13" end="13" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="13" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_MPU_SCRM2SCRP1_ADDR_ERR0" width="1" begin="12" end="12" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="12" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_MPU_SCRM2SCRP0_ADDR_ERR0" width="1" begin="11" end="11" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="11" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_MPU_QSPI_ADDR_ERR0" width="1" begin="10" end="10" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="10" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_MPU_MBOX_ADDR_ERR0" width="1" begin="9" end="9" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="9" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_MPU_DTHE_A_ADDR_ERR0" width="1" begin="8" end="8" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="8" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_MPU_CR5B1_AXIS_ADDR_ERR0" width="1" begin="7" end="7" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="7" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_MPU_CR5A1_AXIS_ADDR_ERR0" width="1" begin="6" end="6" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="6" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_MPU_CR5B0_AXIS_ADDR_ERR0" width="1" begin="5" end="5" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="5" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_MPU_CR5A0_AXIS_ADDR_ERR0" width="1" begin="4" end="4" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="4" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_MPU_L2_BANK_D_ADDR_ERR0" width="1" begin="3" end="3" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="3" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_MPU_L2_BANK_C_ADDR_ERR0" width="1" begin="2" end="2" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="2" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_MPU_L2_BANK_B_ADDR_ERR0" width="1" begin="1" end="1" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="1" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_MPU_L2_BANK_A_ADDR_ERR0" width="1" begin="0" end="0" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MPU_ADDR_INTR_ERRAGG0_STATUS_RAW" acronym="MSS_CTRL_MPU_ADDR_INTR_ERRAGG0_STATUS_RAW" offset="16424" width="32" description="This register shows the Status of all MPU Address Errors.">
		<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_RAW_MPU_HSM_ADDR_ERR0" width="1" begin="17" end="17" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="17" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_RAW_MPU_CR5B1_AHB_ADDR_ERR0" width="1" begin="16" end="16" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="16" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_RAW_MPU_CR5A1_AHB_ADDR_ERR0" width="1" begin="15" end="15" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="15" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_RAW_MPU_CR5B0_AHB_ADDR_ERR0" width="1" begin="14" end="14" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="14" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_RAW_MPU_CR5A0_AHB_ADDR_ERR0" width="1" begin="13" end="13" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="13" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_RAW_MPU_SCRM2SCRP1_ADDR_ERR0" width="1" begin="12" end="12" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="12" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_RAW_MPU_SCRM2SCRP0_ADDR_ERR0" width="1" begin="11" end="11" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="11" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_RAW_MPU_QSPI_ADDR_ERR0" width="1" begin="10" end="10" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="10" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_RAW_MPU_MBOX_ADDR_ERR0" width="1" begin="9" end="9" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="9" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_RAW_MPU_DTHE_A_ADDR_ERR0" width="1" begin="8" end="8" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="8" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_RAW_MPU_CR5B1_AXIS_ADDR_ERR0" width="1" begin="7" end="7" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="7" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_RAW_MPU_CR5A1_AXIS_ADDR_ERR0" width="1" begin="6" end="6" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="6" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_RAW_MPU_CR5B0_AXIS_ADDR_ERR0" width="1" begin="5" end="5" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="5" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_RAW_MPU_CR5A0_AXIS_ADDR_ERR0" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="4" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_RAW_MPU_L2_BANK_D_ADDR_ERR0" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="3" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_RAW_MPU_L2_BANK_C_ADDR_ERR0" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="2" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_RAW_MPU_L2_BANK_B_ADDR_ERR0" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="1" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG0_STATUS_RAW_MPU_L2_BANK_A_ADDR_ERR0" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MPU_PROT_INTR_ERRAGG0_MASK" acronym="MSS_CTRL_MPU_PROT_INTR_ERRAGG0_MASK" offset="16432" width="32" description="This register Masks selected interrupt soures from generating MPU Protection Error Interrupt to R5SS0 CORE0 .">
		<bitfield id="MPU_PROT_INTR_ERRAGG0_MASK_MPU_HSM_PROT_ERR0" width="1" begin="17" end="17" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="17" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG0_MASK_MPU_CR5B1_AHB_PROT_ERR0" width="1" begin="16" end="16" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="16" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG0_MASK_MPU_CR5A1_AHB_PROT_ERR0" width="1" begin="15" end="15" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="15" rwaccess="R/W"/>
