ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/MSS_CTRL_MSS_CTRL_50D00000h.xml
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_MASK_MPU_SCRM2SCRP0_ADDR_ERR1" width="1" begin="11" end="11" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="11" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_MASK_MPU_QSPI_ADDR_ERR1" width="1" begin="10" end="10" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="10" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_MASK_MPU_MBOX_ADDR_ERR1" width="1" begin="9" end="9" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="9" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_MASK_MPU_DTHE_A_ADDR_ERR1" width="1" begin="8" end="8" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="8" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_MASK_MPU_CR5B1_AXIS_ADDR_ERR1" width="1" begin="7" end="7" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="7" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_MASK_MPU_CR5A1_AXIS_ADDR_ERR1" width="1" begin="6" end="6" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="6" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_MASK_MPU_CR5B0_AXIS_ADDR_ERR1" width="1" begin="5" end="5" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="5" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_MASK_MPU_CR5A0_AXIS_ADDR_ERR1" width="1" begin="4" end="4" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="4" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_MASK_MPU_L2_BANK_D_ADDR_ERR1" width="1" begin="3" end="3" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="3" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_MASK_MPU_L2_BANK_C_ADDR_ERR1" width="1" begin="2" end="2" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="2" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_MASK_MPU_L2_BANK_B_ADDR_ERR1" width="1" begin="1" end="1" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="1" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_MASK_MPU_L2_BANK_A_ADDR_ERR1" width="1" begin="0" end="0" resetval="0x0" description="Mask Error from MPU_ADDR_INTR to aggregated Error MPU_ADDR_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MPU_ADDR_INTR_ERRAGG1_STATUS" acronym="MSS_CTRL_MPU_ADDR_INTR_ERRAGG1_STATUS" offset="32804" width="32" description="This register shows the Status of Unmasked MPU Address Errors to R5SS0 CORE1 .">
		<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_MPU_HSM_ADDR_ERR1" width="1" begin="17" end="17" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="17" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_MPU_CR5B1_AHB_ADDR_ERR1" width="1" begin="16" end="16" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="16" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_MPU_CR5A1_AHB_ADDR_ERR1" width="1" begin="15" end="15" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="15" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_MPU_CR5B0_AHB_ADDR_ERR1" width="1" begin="14" end="14" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="14" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_MPU_CR5A0_AHB_ADDR_ERR1" width="1" begin="13" end="13" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="13" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_MPU_SCRM2SCRP1_ADDR_ERR1" width="1" begin="12" end="12" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="12" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_MPU_SCRM2SCRP0_ADDR_ERR1" width="1" begin="11" end="11" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="11" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_MPU_QSPI_ADDR_ERR1" width="1" begin="10" end="10" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="10" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_MPU_MBOX_ADDR_ERR1" width="1" begin="9" end="9" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="9" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_MPU_DTHE_A_ADDR_ERR1" width="1" begin="8" end="8" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="8" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_MPU_CR5B1_AXIS_ADDR_ERR1" width="1" begin="7" end="7" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="7" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_MPU_CR5A1_AXIS_ADDR_ERR1" width="1" begin="6" end="6" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="6" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_MPU_CR5B0_AXIS_ADDR_ERR1" width="1" begin="5" end="5" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="5" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_MPU_CR5A0_AXIS_ADDR_ERR1" width="1" begin="4" end="4" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="4" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_MPU_L2_BANK_D_ADDR_ERR1" width="1" begin="3" end="3" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="3" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_MPU_L2_BANK_C_ADDR_ERR1" width="1" begin="2" end="2" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="2" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_MPU_L2_BANK_B_ADDR_ERR1" width="1" begin="1" end="1" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="1" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_MPU_L2_BANK_A_ADDR_ERR1" width="1" begin="0" end="0" resetval="0x0" description="Status of Error from MPU_ADDR_INTR. Set only if Interupt is unmasked in MPU_ADDR_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MPU_ADDR_INTR_ERRAGG1_STATUS_RAW" acronym="MSS_CTRL_MPU_ADDR_INTR_ERRAGG1_STATUS_RAW" offset="32808" width="32" description="This register shows the Status of all MPU Address Errors.">
		<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_RAW_MPU_HSM_ADDR_ERR1" width="1" begin="17" end="17" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="17" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_RAW_MPU_CR5B1_AHB_ADDR_ERR1" width="1" begin="16" end="16" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="16" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_RAW_MPU_CR5A1_AHB_ADDR_ERR1" width="1" begin="15" end="15" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="15" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_RAW_MPU_CR5B0_AHB_ADDR_ERR1" width="1" begin="14" end="14" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="14" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_RAW_MPU_CR5A0_AHB_ADDR_ERR1" width="1" begin="13" end="13" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="13" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_RAW_MPU_SCRM2SCRP1_ADDR_ERR1" width="1" begin="12" end="12" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="12" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_RAW_MPU_SCRM2SCRP0_ADDR_ERR1" width="1" begin="11" end="11" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="11" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_RAW_MPU_QSPI_ADDR_ERR1" width="1" begin="10" end="10" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="10" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_RAW_MPU_MBOX_ADDR_ERR1" width="1" begin="9" end="9" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="9" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_RAW_MPU_DTHE_A_ADDR_ERR1" width="1" begin="8" end="8" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="8" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_RAW_MPU_CR5B1_AXIS_ADDR_ERR1" width="1" begin="7" end="7" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="7" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_RAW_MPU_CR5A1_AXIS_ADDR_ERR1" width="1" begin="6" end="6" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="6" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_RAW_MPU_CR5B0_AXIS_ADDR_ERR1" width="1" begin="5" end="5" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="5" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_RAW_MPU_CR5A0_AXIS_ADDR_ERR1" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="4" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_RAW_MPU_L2_BANK_D_ADDR_ERR1" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="3" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_RAW_MPU_L2_BANK_C_ADDR_ERR1" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="2" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_RAW_MPU_L2_BANK_B_ADDR_ERR1" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="1" rwaccess="R/W"/>
	<bitfield id="MPU_ADDR_INTR_ERRAGG1_STATUS_RAW_MPU_L2_BANK_A_ADDR_ERR1" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Error from MPU_ADDR_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_ADDR_INTR_ERRAGG_MASK" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MPU_PROT_INTR_ERRAGG1_MASK" acronym="MSS_CTRL_MPU_PROT_INTR_ERRAGG1_MASK" offset="32816" width="32" description="This register Masks selected interrupt soures from generating MPU Protection Error Interrupt to R5SS0 CORE1 .">
		<bitfield id="MPU_PROT_INTR_ERRAGG1_MASK_MPU_HSM_PROT_ERR1" width="1" begin="17" end="17" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="17" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_MASK_MPU_CR5B1_AHB_PROT_ERR1" width="1" begin="16" end="16" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="16" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_MASK_MPU_CR5A1_AHB_PROT_ERR1" width="1" begin="15" end="15" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="15" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_MASK_MPU_CR5B0_AHB_PROT_ERR1" width="1" begin="14" end="14" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="14" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_MASK_MPU_CR5A0_AHB_PROT_ERR1" width="1" begin="13" end="13" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="13" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_MASK_MPU_SCRM2SCRP1_PROT_ERR1" width="1" begin="12" end="12" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="12" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_MASK_MPU_SCRM2SCRP0_PROT_ERR1" width="1" begin="11" end="11" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="11" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_MASK_MPU_QSPI_PROT_ERR1" width="1" begin="10" end="10" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="10" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_MASK_MPU_MBOX_PROT_ERR1" width="1" begin="9" end="9" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="9" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_MASK_MPU_DTHE_A_PROT_ERR1" width="1" begin="8" end="8" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="8" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_MASK_MPU_CR5B1_AXIS_PROT_ERR1" width="1" begin="7" end="7" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="7" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_MASK_MPU_CR5A1_AXIS_PROT_ERR1" width="1" begin="6" end="6" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="6" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_MASK_MPU_CR5B0_AXIS_PROT_ERR1" width="1" begin="5" end="5" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="5" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_MASK_MPU_CR5A0_AXIS_PROT_ERR1" width="1" begin="4" end="4" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="4" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_MASK_MPU_L2_BANK_D_PROT_ERR1" width="1" begin="3" end="3" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="3" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_MASK_MPU_L2_BANK_C_PROT_ERR1" width="1" begin="2" end="2" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="2" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_MASK_MPU_L2_BANK_B_PROT_ERR1" width="1" begin="1" end="1" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="1" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_MASK_MPU_L2_BANK_A_PROT_ERR1" width="1" begin="0" end="0" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MPU_PROT_INTR_ERRAGG1_STATUS" acronym="MSS_CTRL_MPU_PROT_INTR_ERRAGG1_STATUS" offset="32820" width="32" description="This register shows the Status of Unmasked MPU Protection Errors to R5SS0 CORE1 .">
		<bitfield id="MPU_PROT_INTR_ERRAGG1_STATUS_MPU_HSM_PROT_ERR1" width="1" begin="17" end="17" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="17" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_STATUS_MPU_CR5B1_AHB_PROT_ERR1" width="1" begin="16" end="16" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="16" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_STATUS_MPU_CR5A1_AHB_PROT_ERR1" width="1" begin="15" end="15" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="15" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_STATUS_MPU_CR5B0_AHB_PROT_ERR1" width="1" begin="14" end="14" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="14" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_STATUS_MPU_CR5A0_AHB_PROT_ERR1" width="1" begin="13" end="13" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="13" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_STATUS_MPU_SCRM2SCRP1_PROT_ERR1" width="1" begin="12" end="12" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="12" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_STATUS_MPU_SCRM2SCRP0_PROT_ERR1" width="1" begin="11" end="11" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="11" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_STATUS_MPU_QSPI_PROT_ERR1" width="1" begin="10" end="10" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="10" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_STATUS_MPU_MBOX_PROT_ERR1" width="1" begin="9" end="9" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="9" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_STATUS_MPU_DTHE_A_PROT_ERR1" width="1" begin="8" end="8" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="8" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_STATUS_MPU_CR5B1_AXIS_PROT_ERR1" width="1" begin="7" end="7" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="7" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_STATUS_MPU_CR5A1_AXIS_PROT_ERR1" width="1" begin="6" end="6" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="6" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_STATUS_MPU_CR5B0_AXIS_PROT_ERR1" width="1" begin="5" end="5" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="5" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_STATUS_MPU_CR5A0_AXIS_PROT_ERR1" width="1" begin="4" end="4" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="4" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_STATUS_MPU_L2_BANK_D_PROT_ERR1" width="1" begin="3" end="3" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="3" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_STATUS_MPU_L2_BANK_C_PROT_ERR1" width="1" begin="2" end="2" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="2" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG1_STATUS_MPU_L2_BANK_B_PROT_ERR1" width="1" begin="1" end="1" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="1" rwaccess="R/W"/>
