ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/MSS_CTRL_MSS_CTRL_50D00000h.xml
	<bitfield id="MPU_PROT_INTR_ERRAGG3_MASK_MPU_L2_BANK_C_PROT_ERR3" width="1" begin="2" end="2" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="2" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_MASK_MPU_L2_BANK_B_PROT_ERR3" width="1" begin="1" end="1" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="1" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_MASK_MPU_L2_BANK_A_PROT_ERR3" width="1" begin="0" end="0" resetval="0x0" description="Mask Error from MPU_PROT_INTR to aggregated Error MPU_PROT_INTR_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MPU_PROT_INTR_ERRAGG3_STATUS" acronym="MSS_CTRL_MPU_PROT_INTR_ERRAGG3_STATUS" offset="65588" width="32" description="This register shows the Status of Unmasked MPU Protection Errors to R5SS1 CORE1 .">
		<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_MPU_HSM_PROT_ERR3" width="1" begin="17" end="17" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="17" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_MPU_CR5B1_AHB_PROT_ERR3" width="1" begin="16" end="16" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="16" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_MPU_CR5A1_AHB_PROT_ERR3" width="1" begin="15" end="15" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="15" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_MPU_CR5B0_AHB_PROT_ERR3" width="1" begin="14" end="14" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="14" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_MPU_CR5A0_AHB_PROT_ERR3" width="1" begin="13" end="13" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="13" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_MPU_SCRM2SCRP1_PROT_ERR3" width="1" begin="12" end="12" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="12" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_MPU_SCRM2SCRP0_PROT_ERR3" width="1" begin="11" end="11" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="11" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_MPU_QSPI_PROT_ERR3" width="1" begin="10" end="10" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="10" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_MPU_MBOX_PROT_ERR3" width="1" begin="9" end="9" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="9" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_MPU_DTHE_A_PROT_ERR3" width="1" begin="8" end="8" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="8" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_MPU_CR5B1_AXIS_PROT_ERR3" width="1" begin="7" end="7" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="7" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_MPU_CR5A1_AXIS_PROT_ERR3" width="1" begin="6" end="6" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="6" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_MPU_CR5B0_AXIS_PROT_ERR3" width="1" begin="5" end="5" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="5" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_MPU_CR5A0_AXIS_PROT_ERR3" width="1" begin="4" end="4" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="4" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_MPU_L2_BANK_D_PROT_ERR3" width="1" begin="3" end="3" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="3" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_MPU_L2_BANK_C_PROT_ERR3" width="1" begin="2" end="2" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="2" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_MPU_L2_BANK_B_PROT_ERR3" width="1" begin="1" end="1" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="1" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_MPU_L2_BANK_A_PROT_ERR3" width="1" begin="0" end="0" resetval="0x0" description="Status of Error from MPU_PROT_INTR. Set only if Interupt is unmasked in MPU_PROT_INTR_ERRAGG_MASKWrie 0x1 to clear this Error." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MPU_PROT_INTR_ERRAGG3_STATUS_RAW" acronym="MSS_CTRL_MPU_PROT_INTR_ERRAGG3_STATUS_RAW" offset="65592" width="32" description="This register shows the Status of all MPU Protection Errors.">
		<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_RAW_MPU_HSM_PROT_ERR3" width="1" begin="17" end="17" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="17" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_RAW_MPU_CR5B1_AHB_PROT_ERR3" width="1" begin="16" end="16" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="16" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_RAW_MPU_CR5A1_AHB_PROT_ERR3" width="1" begin="15" end="15" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="15" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_RAW_MPU_CR5B0_AHB_PROT_ERR3" width="1" begin="14" end="14" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="14" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_RAW_MPU_CR5A0_AHB_PROT_ERR3" width="1" begin="13" end="13" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="13" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_RAW_MPU_SCRM2SCRP1_PROT_ERR3" width="1" begin="12" end="12" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="12" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_RAW_MPU_SCRM2SCRP0_PROT_ERR3" width="1" begin="11" end="11" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="11" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_RAW_MPU_QSPI_PROT_ERR3" width="1" begin="10" end="10" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="10" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_RAW_MPU_MBOX_PROT_ERR3" width="1" begin="9" end="9" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="9" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_RAW_MPU_DTHE_A_PROT_ERR3" width="1" begin="8" end="8" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="8" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_RAW_MPU_CR5B1_AXIS_PROT_ERR3" width="1" begin="7" end="7" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="7" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_RAW_MPU_CR5A1_AXIS_PROT_ERR3" width="1" begin="6" end="6" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="6" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_RAW_MPU_CR5B0_AXIS_PROT_ERR3" width="1" begin="5" end="5" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="5" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_RAW_MPU_CR5A0_AXIS_PROT_ERR3" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="4" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_RAW_MPU_L2_BANK_D_PROT_ERR3" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="3" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_RAW_MPU_L2_BANK_C_PROT_ERR3" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="2" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_RAW_MPU_L2_BANK_B_PROT_ERR3" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="1" rwaccess="R/W"/>
	<bitfield id="MPU_PROT_INTR_ERRAGG3_STATUS_RAW_MPU_L2_BANK_A_PROT_ERR3" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Error from MPU_PROT_INTR. Set irrespective if the Interupt is masked or unmasked in MPU_PROT_INTR_ERRAGG_MASK" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_PRU_ICSS_PRU0_MBOX_WRITE_DONE" acronym="MSS_CTRL_PRU_ICSS_PRU0_MBOX_WRITE_DONE" offset="81920" width="32" description="This register is used by ICSSM PRU0 to generate Mailbox interrupt to Recipent CPU.">
		<bitfield id="PRU_ICSS_PRU0_MBOX_WRITE_DONE_PROC_7" width="1" begin="28" end="28" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 7" range="28" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_WRITE_DONE_PROC_6" width="1" begin="24" end="24" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 6" range="24" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_WRITE_DONE_PROC_5" width="1" begin="20" end="20" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 5" range="20" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_WRITE_DONE_PROC_4" width="1" begin="16" end="16" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 4" range="16" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_WRITE_DONE_PROC_3" width="1" begin="12" end="12" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 3" range="12" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_WRITE_DONE_PROC_2" width="1" begin="8" end="8" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 2" range="8" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_WRITE_DONE_PROC_1" width="1" begin="4" end="4" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 1" range="4" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_WRITE_DONE_PROC_0" width="1" begin="0" end="0" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 0" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_PRU_ICSS_PRU0_MBOX_READ_REQ" acronym="MSS_CTRL_PRU_ICSS_PRU0_MBOX_READ_REQ" offset="81924" width="32" description="This register is used by ICSSM PRU0 to know the Sender of Mailbox Interrupt as well as clear it.">
		<bitfield id="PRU_ICSS_PRU0_MBOX_READ_REQ_PROC_7" width="1" begin="28" end="28" resetval="0x0" description="This is request from  processor 7 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="28" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_REQ_PROC_6" width="1" begin="24" end="24" resetval="0x0" description="This is request from  processor 6 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="24" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_REQ_PROC_5" width="1" begin="20" end="20" resetval="0x0" description="This is request from  processor 5 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="20" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_REQ_PROC_4" width="1" begin="16" end="16" resetval="0x0" description="This is request from  processor 4 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="16" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_REQ_PROC_3" width="1" begin="12" end="12" resetval="0x0" description="This is request from  processor 3 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="12" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_REQ_PROC_2" width="1" begin="8" end="8" resetval="0x0" description="This is request from  processor 2 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="8" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_REQ_PROC_1" width="1" begin="4" end="4" resetval="0x0" description="This is request from  processor 1 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="4" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_REQ_PROC_0" width="1" begin="0" end="0" resetval="0x0" description="This is request from  processor 0 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_PRU_ICSS_PRU0_MBOX_READ_DONE_ACK" acronym="MSS_CTRL_PRU_ICSS_PRU0_MBOX_READ_DONE_ACK" offset="81928" width="32" description="This register is used by ICSSM PRU0 to generate Mailbox Read acknowledgement to the Sender CPU.">
		<bitfield id="PRU_ICSS_PRU0_MBOX_READ_DONE_ACK_PROC" width="8" begin="7" end="0" resetval="0x0" description="Write pulse bit field:For bits 0 to7:Wrting1'b1 : Generates pulse interrupt to corresponding proc from ICSSM_PRU0.For bits 8 to15:Wrting1'b1 : Generates pulse interrupt to corresponding proc from ICSSM_PRU1." range="7:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_PRU_ICSS_PRU0_MBOX_READ_DONE" acronym="MSS_CTRL_PRU_ICSS_PRU0_MBOX_READ_DONE" offset="81932" width="32" description="This register is used by ICSSM PRU0 to know that the Receiver CPU has read the Mailbox and Acked. It is also used to clear the Read Done Interrupt.">
		<bitfield id="PRU_ICSS_PRU0_MBOX_READ_DONE_PROC_7" width="1" begin="28" end="28" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc7's mailbox written by ICSSM_PRU" range="28" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_DONE_PROC_6" width="1" begin="24" end="24" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc6's mailbox written by ICSSM_PRU" range="24" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_DONE_PROC_5" width="1" begin="20" end="20" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc5's mailbox written by ICSSM_PRU" range="20" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_DONE_PROC_4" width="1" begin="16" end="16" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc4's mailbox written by ICSSM_PRU" range="16" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_DONE_PROC_3" width="1" begin="12" end="12" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc3's mailbox written by ICSSM_PRU" range="12" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_DONE_PROC_2" width="1" begin="8" end="8" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc2's mailbox written by ICSSM_PRU" range="8" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_DONE_PROC_1" width="1" begin="4" end="4" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc1's mailbox written by ICSSM_PRU" range="4" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU0_MBOX_READ_DONE_PROC_0" width="1" begin="0" end="0" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc0's mailbox written by ICSSM_PRU" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_PRU_ICSS_PRU1_MBOX_WRITE_DONE" acronym="MSS_CTRL_PRU_ICSS_PRU1_MBOX_WRITE_DONE" offset="81936" width="32" description="This register is used by ICSSM PRU1 to generate Mailbox interrupt to Recipent CPU.">
		<bitfield id="PRU_ICSS_PRU1_MBOX_WRITE_DONE_PROC_7" width="1" begin="28" end="28" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 7" range="28" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_WRITE_DONE_PROC_6" width="1" begin="24" end="24" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 6" range="24" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_WRITE_DONE_PROC_5" width="1" begin="20" end="20" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 5" range="20" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_WRITE_DONE_PROC_4" width="1" begin="16" end="16" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 4" range="16" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_WRITE_DONE_PROC_3" width="1" begin="12" end="12" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 3" range="12" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_WRITE_DONE_PROC_2" width="1" begin="8" end="8" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 2" range="8" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_WRITE_DONE_PROC_1" width="1" begin="4" end="4" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 1" range="4" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_WRITE_DONE_PROC_0" width="1" begin="0" end="0" resetval="0x0" description="Write pulse bit field:This register should be written once finishing Writing into the mailbox memory of processor 0" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_PRU_ICSS_PRU1_MBOX_READ_REQ" acronym="MSS_CTRL_PRU_ICSS_PRU1_MBOX_READ_REQ" offset="81940" width="32" description="This register is used by ICSSM PRU1 to know the Sender of Mailbox Interrupt as well as clear it.">
		<bitfield id="PRU_ICSS_PRU1_MBOX_READ_REQ_PROC_7" width="1" begin="28" end="28" resetval="0x0" description="This is request from  processor 7 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="28" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_REQ_PROC_6" width="1" begin="24" end="24" resetval="0x0" description="This is request from  processor 6 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="24" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_REQ_PROC_5" width="1" begin="20" end="20" resetval="0x0" description="This is request from  processor 5 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="20" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_REQ_PROC_4" width="1" begin="16" end="16" resetval="0x0" description="This is request from  processor 4 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="16" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_REQ_PROC_3" width="1" begin="12" end="12" resetval="0x0" description="This is request from  processor 3 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="12" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_REQ_PROC_2" width="1" begin="8" end="8" resetval="0x0" description="This is request from  processor 2 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="8" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_REQ_PROC_1" width="1" begin="4" end="4" resetval="0x0" description="This is request from  processor 1 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="4" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_REQ_PROC_0" width="1" begin="0" end="0" resetval="0x0" description="This is request from  processor 0 to corresponding ICSSM_PRU. Requesting it to read from mailbox." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_PRU_ICSS_PRU1_MBOX_READ_DONE_ACK" acronym="MSS_CTRL_PRU_ICSS_PRU1_MBOX_READ_DONE_ACK" offset="81944" width="32" description="This register is used by ICSSM PRU1 to generate Mailbox Read acknowledgement to the Sender CPU.">
		<bitfield id="PRU_ICSS_PRU1_MBOX_READ_DONE_ACK_PROC" width="8" begin="7" end="0" resetval="0x0" description="Write pulse bit field:For bits 0 to7:Wrting1'b1 : Generates pulse interrupt to corresponding proc from ICSSM_PRU0.For bits 8 to15:Wrting1'b1 : Generates pulse interrupt to corresponding proc from ICSSM_PRU1." range="7:0" rwaccess="R/W"/>
