ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/MSS_CTRL_MSS_CTRL_50D00000h.xml
	</register><register id="MSS_CTRL_PRU_ICSS_PRU1_MBOX_READ_DONE" acronym="MSS_CTRL_PRU_ICSS_PRU1_MBOX_READ_DONE" offset="81948" width="32" description="This register is used by ICSSM PRU1 to know that the Receiver CPU has read the Mailbox and Acked. It is also used to clear the Read Done Interrupt.">
		<bitfield id="PRU_ICSS_PRU1_MBOX_READ_DONE_PROC_7" width="1" begin="28" end="28" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc7's mailbox written by ICSSM_PRU" range="28" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_DONE_PROC_6" width="1" begin="24" end="24" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc6's mailbox written by ICSSM_PRU" range="24" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_DONE_PROC_5" width="1" begin="20" end="20" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc5's mailbox written by ICSSM_PRU" range="20" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_DONE_PROC_4" width="1" begin="16" end="16" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc4's mailbox written by ICSSM_PRU" range="16" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_DONE_PROC_3" width="1" begin="12" end="12" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc3's mailbox written by ICSSM_PRU" range="12" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_DONE_PROC_2" width="1" begin="8" end="8" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc2's mailbox written by ICSSM_PRU" range="8" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_DONE_PROC_1" width="1" begin="4" end="4" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc1's mailbox written by ICSSM_PRU" range="4" rwaccess="R/W"/>
	<bitfield id="PRU_ICSS_PRU1_MBOX_READ_DONE_PROC_0" width="1" begin="0" end="0" resetval="0x0" description="This register should be written once finishing Reading from corresponding proc0's mailbox written by ICSSM_PRU" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_TPCC_A_ERRAGG_MASK" acronym="MSS_CTRL_MSS_TPCC_A_ERRAGG_MASK" offset="98304" width="32" description="This register Masks selected interrupt soures  from generating the Aggregated TPCC0 Error Interrupt.">
		<bitfield id="MSS_TPCC_A_ERRAGG_MASK_TPTC_A1_READ_ACCESS_ERROR" width="1" begin="26" end="26" resetval="0x0" description="Mask Error from MSS_TPTC_A1 to aggregated Error MSS_TPCC_A_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="26" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_MASK_TPTC_A0_READ_ACCESS_ERROR" width="1" begin="25" end="25" resetval="0x0" description="Mask Error from MSS_TPTC_A0 to aggregated Error MSS_TPCC_A_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="25" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_MASK_TPCC_A_READ_ACCESS_ERROR" width="1" begin="24" end="24" resetval="0x0" description="Mask Error from MSS_TPCC_A to aggregated Error MSS_TPCC_A_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="24" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_MASK_TPTC_A1_WRITE_ACCESS_ERROR" width="1" begin="18" end="18" resetval="0x0" description="Mask Error from MSS_TPTC_A1 to aggregated Error MSS_TPCC_A_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="18" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_MASK_TPTC_A0_WRITE_ACCESS_ERROR" width="1" begin="17" end="17" resetval="0x0" description="Mask Error from MSS_TPTC_A0 to aggregated Error MSS_TPCC_A_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="17" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_MASK_TPCC_A_WRITE_ACCESS_ERROR" width="1" begin="16" end="16" resetval="0x0" description="Mask Error from MSS_TPCC_A to aggregated Error MSS_TPCC_A_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="16" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_MASK_TPCC_A_PAR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Mask Error from MSS_TPCC_A to aggregated Error MSS_TPCC_A_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="4" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_MASK_TPTC_A1_ERR" width="1" begin="3" end="3" resetval="0x0" description="Mask Error from MSS_TPTC_A1 to aggregated Error MSS_TPCC_A_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="3" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_MASK_TPTC_A0_ERR" width="1" begin="2" end="2" resetval="0x0" description="Mask Error from MSS_TPTC_A0 to aggregated Error MSS_TPCC_A_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="2" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_MASK_TPCC_A_MPINT" width="1" begin="1" end="1" resetval="0x0" description="Mask Error from MSS_TPCC_A to aggregated Error MSS_TPCC_A_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="1" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_MASK_TPCC_A_ERRINT" width="1" begin="0" end="0" resetval="0x0" description="Mask Error from MSS_TPCC_A to aggregated Error MSS_TPCC_A_ERRAGG1'b1 : Error is Masked1'b0 : Error is Unmasked" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_TPCC_A_ERRAGG_STATUS" acronym="MSS_CTRL_MSS_TPCC_A_ERRAGG_STATUS" offset="98308" width="32" description="This register shows the Status of Unmasked Errors from TPCC0.">
		<bitfield id="MSS_TPCC_A_ERRAGG_STATUS_TPTC_A1_READ_ACCESS_ERROR" width="1" begin="26" end="26" resetval="0x0" description="Status of Error from MSS_TPTC_A1. Set only if Interupt is unmasked in MSS_TPCC_A_ERRAGG_MASKWrie 0x1 to clear this Error." range="26" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_STATUS_TPTC_A0_READ_ACCESS_ERROR" width="1" begin="25" end="25" resetval="0x0" description="Status of Error from MSS_TPTC_A0. Set only if Interupt is unmasked in MSS_TPCC_A_ERRAGG_MASKWrie 0x1 to clear this Error." range="25" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_STATUS_TPCC_A_READ_ACCESS_ERROR" width="1" begin="24" end="24" resetval="0x0" description="Status of Error from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_ERRAGG_MASKWrie 0x1 to clear this Error." range="24" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_STATUS_TPTC_A1_WRITE_ACCESS_ERROR" width="1" begin="18" end="18" resetval="0x0" description="Status of Error from MSS_TPTC_A1. Set only if Interupt is unmasked in MSS_TPCC_A_ERRAGG_MASKWrie 0x1 to clear this Error." range="18" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_STATUS_TPTC_A0_WRITE_ACCESS_ERROR" width="1" begin="17" end="17" resetval="0x0" description="Status of Error from MSS_TPTC_A0. Set only if Interupt is unmasked in MSS_TPCC_A_ERRAGG_MASKWrie 0x1 to clear this Error." range="17" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_STATUS_TPCC_A_WRITE_ACCESS_ERROR" width="1" begin="16" end="16" resetval="0x0" description="Status of Error from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_ERRAGG_MASKWrie 0x1 to clear this Error." range="16" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_STATUS_TPCC_A_PAR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Status of Error from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_ERRAGG_MASKWrie 0x1 to clear this Error." range="4" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_STATUS_TPTC_A1_ERR" width="1" begin="3" end="3" resetval="0x0" description="Status of Error from MSS_TPTC_A1. Set only if Interupt is unmasked in MSS_TPCC_A_ERRAGG_MASKWrie 0x1 to clear this Error." range="3" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_STATUS_TPTC_A0_ERR" width="1" begin="2" end="2" resetval="0x0" description="Status of Error from MSS_TPTC_A0. Set only if Interupt is unmasked in MSS_TPCC_A_ERRAGG_MASKWrie 0x1 to clear this Error." range="2" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_STATUS_TPCC_A_MPINT" width="1" begin="1" end="1" resetval="0x0" description="Status of Error from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_ERRAGG_MASKWrie 0x1 to clear this Error." range="1" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_STATUS_TPCC_A_ERRINT" width="1" begin="0" end="0" resetval="0x0" description="Status of Error from MSS_TPCC_A. Set only if Interupt is unmasked in MSS_TPCC_A_ERRAGG_MASKWrie 0x1 to clear this Error." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_TPCC_A_ERRAGG_STATUS_RAW" acronym="MSS_CTRL_MSS_TPCC_A_ERRAGG_STATUS_RAW" offset="98312" width="32" description="This register shows the Status of all Errors from TPCC0.">
		<bitfield id="MSS_TPCC_A_ERRAGG_STATUS_RAW_TPTC_A1_READ_ACCESS_ERROR" width="1" begin="26" end="26" resetval="0x0" description="Raw Status of Error from MSS_TPTC_A1. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_ERRAGG_MASK" range="26" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_STATUS_RAW_TPTC_A0_READ_ACCESS_ERROR" width="1" begin="25" end="25" resetval="0x0" description="Raw Status of Error from MSS_TPTC_A0. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_ERRAGG_MASK" range="25" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_STATUS_RAW_TPCC_A_READ_ACCESS_ERROR" width="1" begin="24" end="24" resetval="0x0" description="Raw Status of Error from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_ERRAGG_MASK" range="24" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_STATUS_RAW_TPTC_A1_WRITE_ACCESS_ERROR" width="1" begin="18" end="18" resetval="0x0" description="Raw Status of Error from MSS_TPTC_A1. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_ERRAGG_MASK" range="18" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_STATUS_RAW_TPTC_A0_WRITE_ACCESS_ERROR" width="1" begin="17" end="17" resetval="0x0" description="Raw Status of Error from MSS_TPTC_A0. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_ERRAGG_MASK" range="17" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_STATUS_RAW_TPCC_A_WRITE_ACCESS_ERROR" width="1" begin="16" end="16" resetval="0x0" description="Raw Status of Error from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_ERRAGG_MASK" range="16" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_STATUS_RAW_TPCC_A_PAR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Error from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_ERRAGG_MASK" range="4" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_STATUS_RAW_TPTC_A1_ERR" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Error from MSS_TPTC_A1. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_ERRAGG_MASK" range="3" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_STATUS_RAW_TPTC_A0_ERR" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Error from MSS_TPTC_A0. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_ERRAGG_MASK" range="2" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_STATUS_RAW_TPCC_A_MPINT" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Error from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_ERRAGG_MASK" range="1" rwaccess="R/W"/>
	<bitfield id="MSS_TPCC_A_ERRAGG_STATUS_RAW_TPCC_A_ERRINT" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Error from MSS_TPCC_A. Set irrespective if the Interupt is masked or unmasked in MSS_TPCC_A_ERRAGG_MASK" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_PERIPH_ERRAGG_MASK0" acronym="MSS_CTRL_MSS_PERIPH_ERRAGG_MASK0" offset="98320" width="32" description="This register Masks selected interrupt soures  from generating the Aggregated MMR Access Error Interrupt.">
		<bitfield id="MSS_PERIPH_ERRAGG_MASK0_HSM_CTRL_WR" width="1" begin="11" end="11" resetval="0x0" description="Mask Interrupt from HSM_CTRL to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="11" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_MASK0_HSM_CTRL_RD" width="1" begin="10" end="10" resetval="0x0" description="Mask Interrupt from HSM_CTRL to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="10" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_MASK0_HSM_SOC_CTRL_WR" width="1" begin="9" end="9" resetval="0x0" description="Mask Interrupt from HSM_SOC_CTRL to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="9" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_MASK0_HSM_SOC_CTRL_RD" width="1" begin="8" end="8" resetval="0x0" description="Mask Interrupt from HSM_SOC_CTRL to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="8" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_MASK0_TOP_RCM_WR" width="1" begin="7" end="7" resetval="0x0" description="Mask Interrupt from TOP_RCM to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="7" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_MASK0_TOP_RCM_RD" width="1" begin="6" end="6" resetval="0x0" description="Mask Interrupt from TOP_RCM to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="6" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_MASK0_TOP_CTRL_WR" width="1" begin="5" end="5" resetval="0x0" description="Mask Interrupt from TOP_CTRL to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="5" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_MASK0_TOP_CTRL_RD" width="1" begin="4" end="4" resetval="0x0" description="Mask Interrupt from TOP_CTRL to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="4" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_MASK0_MSS_RCM_WR" width="1" begin="3" end="3" resetval="0x0" description="Mask Interrupt from MSS_RCM to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="3" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_MASK0_MSS_RCM_RD" width="1" begin="2" end="2" resetval="0x0" description="Mask Interrupt from MSS_RCM to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="2" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_MASK0_MSS_CTRL_WR" width="1" begin="1" end="1" resetval="0x0" description="Mask Interrupt from MSS_CTRL to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="1" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_MASK0_MSS_CTRL_RD" width="1" begin="0" end="0" resetval="0x0" description="Mask Interrupt from MSS_CTRL to aggregated Interrupt MSS_PERIPH_ACCESS_ERRAGG1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_PERIPH_ERRAGG_STATUS0" acronym="MSS_CTRL_MSS_PERIPH_ERRAGG_STATUS0" offset="98324" width="32" description="This register shows the Status of Unmasked MMR Access Errors.">
		<bitfield id="MSS_PERIPH_ERRAGG_STATUS0_HSM_CTRL_WR" width="1" begin="11" end="11" resetval="0x0" description="Status of Interrupt from HSM_CTRLSet only if Interupt is unmasked in MSS_PERIPH_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="11" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_STATUS0_HSM_CTRL_RD" width="1" begin="10" end="10" resetval="0x0" description="Status of Interrupt from HSM_CTRLSet only if Interupt is unmasked in MSS_PERIPH_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="10" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_STATUS0_HSM_SOC_CTRL_WR" width="1" begin="9" end="9" resetval="0x0" description="Status of Interrupt from HSM_SOC_CTRLSet only if Interupt is unmasked in MSS_PERIPH_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="9" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_STATUS0_HSM_SOC_CTRL_RD" width="1" begin="8" end="8" resetval="0x0" description="Status of Interrupt from HSM_SOC_CTRLSet only if Interupt is unmasked in MSS_PERIPH_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="8" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_STATUS0_TOP_RCM_WR" width="1" begin="7" end="7" resetval="0x0" description="Status of Interrupt from TOP_RCMSet only if Interupt is unmasked in MSS_PERIPH_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="7" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_STATUS0_TOP_RCM_RD" width="1" begin="6" end="6" resetval="0x0" description="Status of Interrupt from TOP_RCMSet only if Interupt is unmasked in MSS_PERIPH_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="6" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_STATUS0_TOP_CTRL_WR" width="1" begin="5" end="5" resetval="0x0" description="Status of Interrupt from TOP_CTRLSet only if Interupt is unmasked in MSS_PERIPH_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="5" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_STATUS0_TOP_CTRL_RD" width="1" begin="4" end="4" resetval="0x0" description="Status of Interrupt from TOP_CTRLSet only if Interupt is unmasked in MSS_PERIPH_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="4" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_STATUS0_MSS_RCM_WR" width="1" begin="3" end="3" resetval="0x0" description="Status of Interrupt from MSS_RCMSet only if Interupt is unmasked in MSS_PERIPH_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="3" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_STATUS0_MSS_RCM_RD" width="1" begin="2" end="2" resetval="0x0" description="Status of Interrupt from MSS_RCMSet only if Interupt is unmasked in MSS_PERIPH_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_STATUS0_MSS_CTRL_WR" width="1" begin="1" end="1" resetval="0x0" description="Status of Interrupt from MSS_CTRLSet only if Interupt is unmasked in MSS_PERIPH_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_STATUS0_MSS_CTRL_RD" width="1" begin="0" end="0" resetval="0x0" description="Status of Interrupt from MSS_CTRLSet only if Interupt is unmasked in MSS_PERIPH_ERRAGG_MASK0Wrie 0x1 to clear this interrupt." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_PERIPH_ERRAGG_STATUS_RAW0" acronym="MSS_CTRL_MSS_PERIPH_ERRAGG_STATUS_RAW0" offset="98328" width="32" description="This register shows the Status of all MMR Access Errors.">
		<bitfield id="MSS_PERIPH_ERRAGG_STATUS_RAW0_HSM_CTRL_WR" width="1" begin="11" end="11" resetval="0x0" description="Raw Status of Interrupt from HSM_CTRL. Set irrespective if the Interupt is masked or unmasked in MSS_PERIPH_ERRAGG_MASK0" range="11" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_STATUS_RAW0_HSM_CTRL_RD" width="1" begin="10" end="10" resetval="0x0" description="Raw Status of Interrupt from HSM_CTRL. Set irrespective if the Interupt is masked or unmasked in MSS_PERIPH_ERRAGG_MASK0" range="10" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_STATUS_RAW0_HSM_SOC_CTRL_WR" width="1" begin="9" end="9" resetval="0x0" description="Raw Status of Interrupt from HSM_SOC_CTRL. Set irrespective if the Interupt is masked or unmasked in MSS_PERIPH_ERRAGG_MASK0" range="9" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_STATUS_RAW0_HSM_SOC_CTRL_RD" width="1" begin="8" end="8" resetval="0x0" description="Raw Status of Interrupt from HSM_SOC_CTRL. Set irrespective if the Interupt is masked or unmasked in MSS_PERIPH_ERRAGG_MASK0" range="8" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_STATUS_RAW0_TOP_RCM_WR" width="1" begin="7" end="7" resetval="0x0" description="Raw Status of Interrupt from TOP_RCM. Set irrespective if the Interupt is masked or unmasked in MSS_PERIPH_ERRAGG_MASK0" range="7" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_STATUS_RAW0_TOP_RCM_RD" width="1" begin="6" end="6" resetval="0x0" description="Raw Status of Interrupt from TOP_RCM. Set irrespective if the Interupt is masked or unmasked in MSS_PERIPH_ERRAGG_MASK0" range="6" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_STATUS_RAW0_TOP_CTRL_WR" width="1" begin="5" end="5" resetval="0x0" description="Raw Status of Interrupt from TOP_CTRL. Set irrespective if the Interupt is masked or unmasked in MSS_PERIPH_ERRAGG_MASK0" range="5" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_STATUS_RAW0_TOP_CTRL_RD" width="1" begin="4" end="4" resetval="0x0" description="Raw Status of Interrupt from TOP_CTRL. Set irrespective if the Interupt is masked or unmasked in MSS_PERIPH_ERRAGG_MASK0" range="4" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_STATUS_RAW0_MSS_RCM_WR" width="1" begin="3" end="3" resetval="0x0" description="Raw Status of Interrupt from MSS_RCM. Set irrespective if the Interupt is masked or unmasked in MSS_PERIPH_ERRAGG_MASK0" range="3" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_STATUS_RAW0_MSS_RCM_RD" width="1" begin="2" end="2" resetval="0x0" description="Raw Status of Interrupt from MSS_RCM. Set irrespective if the Interupt is masked or unmasked in MSS_PERIPH_ERRAGG_MASK0" range="2" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_STATUS_RAW0_MSS_CTRL_WR" width="1" begin="1" end="1" resetval="0x0" description="Raw Status of Interrupt from MSS_CTRL. Set irrespective if the Interupt is masked or unmasked in MSS_PERIPH_ERRAGG_MASK0" range="1" rwaccess="R/W"/>
	<bitfield id="MSS_PERIPH_ERRAGG_STATUS_RAW0_MSS_CTRL_RD" width="1" begin="0" end="0" resetval="0x0" description="Raw Status of Interrupt from MSS_CTRL. Set irrespective if the Interupt is masked or unmasked in MSS_PERIPH_ERRAGG_MASK0" range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_R5SS0_CORE0_ECC_CORR_ERRAGG_MASK" acronym="MSS_CTRL_R5SS0_CORE0_ECC_CORR_ERRAGG_MASK" offset="98432" width="32" description="Register to Mask Correctable error from R5SS0 CORE0 Memories.">
		<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_MASK_R5SS0_CPU0_IDATA_CORR_ERR" width="1" begin="6" end="6" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="6" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_MASK_R5SS0_CPU0_ITAG_CORR_ERR" width="1" begin="5" end="5" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="5" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_MASK_R5SS0_CPU0_DDATA_CORR_ERR" width="1" begin="4" end="4" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="4" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_MASK_R5SS0_CPU0_DTAG_CORR_ERR" width="1" begin="3" end="3" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="3" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_MASK_R5SS0_CPU0_B0TCM_CORR_ERR" width="1" begin="2" end="2" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="2" rwaccess="R/W"/>
	<bitfield id="R5SS0_CPU0_ECC_CORR_ERRAGG_MASK_R5SS0_CPU0_B1TCM_CORR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Mask Interrupt for correctable errors  to aggregated Interrupt of corresponding CPU1'b1 : Interrupt is Masked1'b0 : Interrupt is Unmasked" range="1" rwaccess="R/W"/>
