ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/MSS_CTRL_MSS_CTRL_50D00000h.xml
	<bitfield id="MSS_CR5B0_AXI_RD_BUS_SAFETY_ERR_COMP_ERR" width="8" begin="7" end="0" resetval="0x0" description="1'b1 indicates error in the corresponding Bus whenever a fault is detected at any bus signalBit 0 - This is a Bitwise OR of error compares of all command bus signals.Bit 1 - This is a Bitwise OR of error compares of all write bus signals.Bit 2 - This is a Bitwise OR of error compares of all write status bus signals.Bit 3 - This is a Bitwise OR of error compares of all read bus signals.Bits [7:4] are unused." range="7:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_MSS_R5SS0_CORE1_AXI_RD_BUS_SAFETY_ERR_STAT_DATA0" acronym="MSS_CTRL_MSS_R5SS0_CORE1_AXI_RD_BUS_SAFETY_ERR_STAT_DATA0" offset="98892" width="32" description="This register Indicates the Error Syndrome of Data errors in Bus Safety Comparator of R5SS0 CORE1 AXI RD Initiator Port.">
		<bitfield id="MSS_CR5B0_AXI_RD_BUS_SAFETY_ERR_STAT_DATA0_D1" width="8" begin="15" end="8" resetval="0x0" description="Read this bitfield for Comparator status for Higher 32 bits [63:32] of data bus at this port.  It represent the position of the flipped bit in case of SEC." range="15:8" rwaccess="R"/>
	<bitfield id="MSS_CR5B0_AXI_RD_BUS_SAFETY_ERR_STAT_DATA0_D0" width="8" begin="7" end="0" resetval="0x0" description="Read this bitfield for Comparator status for lower 32 bits [31:0] of data bus at this port.  It represent the position of the flipped bit in case of SEC." range="7:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_MSS_R5SS0_CORE1_AXI_RD_BUS_SAFETY_ERR_STAT_CMD" acronym="MSS_CTRL_MSS_R5SS0_CORE1_AXI_RD_BUS_SAFETY_ERR_STAT_CMD" offset="98896" width="32" description="This register Indicates the Error Syndrome of Command errors in Bus Safety Comparator of R5SS0 CORE1 AXI RD Initiator Port.">
		<bitfield id="MSS_CR5B0_AXI_RD_BUS_SAFETY_ERR_STAT_CMD_STAT" width="32" begin="31" end="0" resetval="0x0" description="Read this bitfield for comparator status for command bus for this port. 1'b1 on any of the bits indicates an error on Command Bus" range="31:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_MSS_R5SS0_CORE1_AXI_RD_BUS_SAFETY_ERR_STAT_READ" acronym="MSS_CTRL_MSS_R5SS0_CORE1_AXI_RD_BUS_SAFETY_ERR_STAT_READ" offset="98900" width="32" description="This register Indicates the Error Syndrome of Read errors in Bus Safety Comparator of R5SS0 CORE1 AXI RD Initiator Port.">
		<bitfield id="MSS_CR5B0_AXI_RD_BUS_SAFETY_ERR_STAT_READ_STAT" width="32" begin="31" end="0" resetval="0x0" description="Read this bitfield for comapartor status for read signals at this port.  1'b1 on any of the bits indicates an error on Read bus." range="31:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_MSS_R5FSS1_CORE0_AXI_RD_BUS_SAFETY_CTRL" acronym="MSS_CTRL_MSS_R5FSS1_CORE0_AXI_RD_BUS_SAFETY_CTRL" offset="98912" width="32" description="This register is used to Control and Configure the Interconnect  Safety Behaviour of R5SS1 CORE0 AXI RD Initiator Port.">
		<bitfield id="MSS_CR5A1_AXI_RD_BUS_SAFETY_CTRL_TYPE" width="8" begin="23" end="16" resetval="0x0" description="This bitfield gives a top level idea of the available bus [cmd,wr,ws,rd] for the particular Target/Initiator and whether it follows the VBUS protocol or not. Bit 0 - 1'b1 indicates the Command bus is implemented to this target/initiator else it is set to 1'b0. Bit 1 - 1'b1 indicates the write bus is implemented to this target/initiator else  it is set to 1'b0. Bit 2 - 1'b1 indicates the write status bus is implemented to this target/initiator else it is set to 1'b0. Bit 3 - 1'b1 indicates the read bus is implemented to this target/initiator else  it is set to 1'b0. Bit 4 - 1'b0 indicates the port follows the VBUS protocol else  it is set to 1'b1. Bits 5-7 are set to 3'b000." range="23:16" rwaccess="R"/>
	<bitfield id="MSS_CR5A1_AXI_RD_BUS_SAFETY_CTRL_ERR_CLEAR" width="1" begin="8" end="8" resetval="0x0" description="Set this bit to 1'b1 to clear the error status for this port" range="8" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A1_AXI_RD_BUS_SAFETY_CTRL_ENABLE" width="3" begin="2" end="0" resetval="0x7" description="Set this bit to 3'b111 to enable the safety configuration for this port.  Set this bit to 3'b000 to disable the safety configuration for this port." range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_R5FSS1_CORE0_AXI_RD_BUS_SAFETY_FI" acronym="MSS_CTRL_MSS_R5FSS1_CORE0_AXI_RD_BUS_SAFETY_FI" offset="98916" width="32" description="This register is used to Inject fault on the Interconnect  Safety comparator of  R5SS1 CORE0 AXI RD Initiator Port.">
		<bitfield id="MSS_CR5A1_AXI_RD_BUS_SAFETY_FI_SAFE" width="8" begin="31" end="24" resetval="0x0" description="This bitfield is used to inject fault on Read, write, command and request bus on the safe Interconnect. Bit 0 - Set this bit to inject fault on the Command bus. Bit 1 - Set this bit to inject fault on theWrite bus. Bit 2 - Set this bit to inject fault on the Write Status bus.Bit 3 - Set this bit to inject fault on the Read bus. Bit 7- Set this bit to inject fault on the corresponding request bus." range="31:24" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A1_AXI_RD_BUS_SAFETY_FI_MAIN" width="8" begin="23" end="16" resetval="0x0" description="This bitfield is used to inject fault on Read, write, command and request bus on the main Interconnect.Bit 0 - Set this bit to inject fault on the Command bus. Bit 1 - Set this bit to inject fault on theWrite bus. Bit 2 - Set this bit to inject fault on the Write Status bus.Bit 3 - Set this bit to inject fault on the Read bus. Bit 7- Set this bit to inject fault on the corresponding request bus." range="23:16" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A1_AXI_RD_BUS_SAFETY_FI_DATA" width="8" begin="15" end="8" resetval="0x0" description="Set bit 0 to 1'b1 to  inject sec and ded faults on [31:0] bits of data bus.Set bit 1 to 1'b1 to  inject sec and ded faults on [64:32] bits of data bus." range="15:8" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A1_AXI_RD_BUS_SAFETY_FI_DED" width="1" begin="5" end="5" resetval="0x0" description="Set this bit to 1'b1 inject ded error on data at this port" range="5" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A1_AXI_RD_BUS_SAFETY_FI_SEC" width="1" begin="4" end="4" resetval="0x0" description="Set this bit to 1'b1 to inject sec error on data at this port" range="4" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A1_AXI_RD_BUS_SAFETY_FI_GLOBAL_SAFE_REQ" width="1" begin="3" end="3" resetval="0x0" description="Set this bit 1'b1 to inject fault for request signals on Safe Interconnect. This is enabled only when the 7th bit of safe bitfield of this register and particular bit coressponding to this port on the safe bitfield of this register is set HIGH" range="3" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A1_AXI_RD_BUS_SAFETY_FI_GLOBAL_MAIN_REQ" width="1" begin="2" end="2" resetval="0x0" description="Set this bit to 1'b1 to inject fault for request signals on main Interconnect. This is enabled only when the 7th bit of main bitfield of this register and particular bit coressponding to this port on the main bitfield of this register is set HIGH" range="2" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A1_AXI_RD_BUS_SAFETY_FI_GLOBAL_SAFE" width="1" begin="1" end="1" resetval="0x0" description="This is a global safe Fault injection signal. Set this bit to inject fault on all the safety buses of the safe interconnect except req signal. Writing a 1'b1 injects fault on interconnect." range="1" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A1_AXI_RD_BUS_SAFETY_FI_GLOBAL_MAIN" width="1" begin="0" end="0" resetval="0x0" description="This is a global main Fault injection signal. Set this bit to inject fault on all the buses of the main interconnect except req signal. Writing a 1'b1 injects fault on interconnect." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_R5FSS1_CORE0_AXI_RD_BUS_SAFETY_ERR" acronym="MSS_CTRL_MSS_R5FSS1_CORE0_AXI_RD_BUS_SAFETY_ERR" offset="98920" width="32" description="This Register provides the Error Status of Bus Safety Comparator of R5SS1 CORE0 AXI RD Initiator port.">
		<bitfield id="MSS_CR5A1_AXI_RD_BUS_SAFETY_ERR_DED" width="8" begin="31" end="24" resetval="0x0" description="This flag signals detection of dual error in Data at this port.Flag is generted for 32 bit segment of Data BusBit 0 - 1'b1 indicates ded on [31:0] bit of Data busBit 1 - 1'b1 indicates ded on [63:32] bit of Data busBit [7:2] - Unused. Set to 1'b0" range="31:24" rwaccess="R"/>
	<bitfield id="MSS_CR5A1_AXI_RD_BUS_SAFETY_ERR_SEC" width="8" begin="23" end="16" resetval="0x0" description="This flag signals detection of single error in Data at this port. Flag is generted for 32 bit segment of Data BusBit 0 - 1'b1 indicates sec on [31:0] bit of Data busBit 1 - 1'b1 indicates sec on [63:32] bit of Data busBit [7:2] - Unused. Set to 1'b0" range="23:16" rwaccess="R"/>
	<bitfield id="MSS_CR5A1_AXI_RD_BUS_SAFETY_ERR_COMP_CHECK" width="8" begin="15" end="8" resetval="0x0" description="This is used to verify the proper functioning of fault Injection on all the buses.1'b1 indicates error in the corresponding Bus has been injected successfully. Bit 0 - This is a Bitwise AND of error compares of all command bus signals.Bit 1 - This is a Bitwise AND of error compares of all write bus signals.Bit 2 - This is a Bitwise AND of error compares of all write status bus signals.Bit 3 - This is a Bitwise AND of error compares of all read bus signals.Bits [7:4] are unused." range="15:8" rwaccess="R"/>
	<bitfield id="MSS_CR5A1_AXI_RD_BUS_SAFETY_ERR_COMP_ERR" width="8" begin="7" end="0" resetval="0x0" description="1'b1 indicates error in the corresponding Bus whenever a fault is detected at any bus signalBit 0 - This is a Bitwise OR of error compares of all command bus signals.Bit 1 - This is a Bitwise OR of error compares of all write bus signals.Bit 2 - This is a Bitwise OR of error compares of all write status bus signals.Bit 3 - This is a Bitwise OR of error compares of all read bus signals.Bits [7:4] are unused." range="7:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_MSS_R5FSS1_CORE0_AXI_RD_BUS_SAFETY_ERR_STAT_DATA0" acronym="MSS_CTRL_MSS_R5FSS1_CORE0_AXI_RD_BUS_SAFETY_ERR_STAT_DATA0" offset="98924" width="32" description="This register Indicates the Error Syndrome of Data errors in Bus Safety Comparator of R5SS1 CORE0 AXI RD Initiator Port.">
		<bitfield id="MSS_CR5A1_AXI_RD_BUS_SAFETY_ERR_STAT_DATA0_D1" width="8" begin="15" end="8" resetval="0x0" description="Read this bitfield for Comparator status for Higher 32 bits [63:32] of data bus at this port.  It represent the position of the flipped bit in case of SEC." range="15:8" rwaccess="R"/>
	<bitfield id="MSS_CR5A1_AXI_RD_BUS_SAFETY_ERR_STAT_DATA0_D0" width="8" begin="7" end="0" resetval="0x0" description="Read this bitfield for Comparator status for lower 32 bits [31:0] of data bus at this port.  It represent the position of the flipped bit in case of SEC." range="7:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_MSS_R5FSS1_CORE0_AXI_RD_BUS_SAFETY_ERR_STAT_CMD" acronym="MSS_CTRL_MSS_R5FSS1_CORE0_AXI_RD_BUS_SAFETY_ERR_STAT_CMD" offset="98928" width="32" description="This register Indicates the Error Syndrome of Command errors in Bus Safety Comparator of R5SS1 CORE0 AXI RD Initiator Port.">
		<bitfield id="MSS_CR5A1_AXI_RD_BUS_SAFETY_ERR_STAT_CMD_STAT" width="32" begin="31" end="0" resetval="0x0" description="Read this bitfield for comparator status for command bus for this port. 1'b1 on any of the bits indicates an error on Command Bus" range="31:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_MSS_R5FSS1_CORE0_AXI_RD_BUS_SAFETY_ERR_STAT_READ" acronym="MSS_CTRL_MSS_R5FSS1_CORE0_AXI_RD_BUS_SAFETY_ERR_STAT_READ" offset="98932" width="32" description="This register Indicates the Error Syndrome of Read errors in Bus Safety Comparator of R5SS1 CORE0 AXI RD Initiator Port.">
		<bitfield id="MSS_CR5A1_AXI_RD_BUS_SAFETY_ERR_STAT_READ_STAT" width="32" begin="31" end="0" resetval="0x0" description="Read this bitfield for comapartor status for read signals at this port.  1'b1 on any of the bits indicates an error on Read bus." range="31:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_MSS_R5FSS1_CORE1_AXI_RD_BUS_SAFETY_CTRL" acronym="MSS_CTRL_MSS_R5FSS1_CORE1_AXI_RD_BUS_SAFETY_CTRL" offset="98944" width="32" description="This register is used to Control and Configure the Interconnect  Safety Behaviour of R5SS1 CORE1 AXI RD Initiator Port.">
		<bitfield id="MSS_CR5B1_AXI_RD_BUS_SAFETY_CTRL_TYPE" width="8" begin="23" end="16" resetval="0x0" description="This bitfield gives a top level idea of the available bus [cmd,wr,ws,rd] for the particular Target/Initiator and whether it follows the VBUS protocol or not. Bit 0 - 1'b1 indicates the Command bus is implemented to this target/initiator else it is set to 1'b0. Bit 1 - 1'b1 indicates the write bus is implemented to this target/initiator else  it is set to 1'b0. Bit 2 - 1'b1 indicates the write status bus is implemented to this target/initiator else it is set to 1'b0. Bit 3 - 1'b1 indicates the read bus is implemented to this target/initiator else  it is set to 1'b0. Bit 4 - 1'b0 indicates the port follows the VBUS protocol else  it is set to 1'b1. Bits 5-7 are set to 3'b000." range="23:16" rwaccess="R"/>
	<bitfield id="MSS_CR5B1_AXI_RD_BUS_SAFETY_CTRL_ERR_CLEAR" width="1" begin="8" end="8" resetval="0x0" description="Set this bit to 1'b1 to clear the error status for this port" range="8" rwaccess="R/W"/>
	<bitfield id="MSS_CR5B1_AXI_RD_BUS_SAFETY_CTRL_ENABLE" width="3" begin="2" end="0" resetval="0x7" description="Set this bit to 3'b111 to enable the safety configuration for this port.  Set this bit to 3'b000 to disable the safety configuration for this port." range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_R5FSS1_CORE1_AXI_RD_BUS_SAFETY_FI" acronym="MSS_CTRL_MSS_R5FSS1_CORE1_AXI_RD_BUS_SAFETY_FI" offset="98948" width="32" description="This register is used to Inject fault on the Interconnect  Safety comparator of  R5SS1 CORE1 AXI RD Initiator Port.">
		<bitfield id="MSS_CR5B1_AXI_RD_BUS_SAFETY_FI_SAFE" width="8" begin="31" end="24" resetval="0x0" description="This bitfield is used to inject fault on Read, write, command and request bus on the safe Interconnect. Bit 0 - Set this bit to inject fault on the Command bus. Bit 1 - Set this bit to inject fault on theWrite bus. Bit 2 - Set this bit to inject fault on the Write Status bus.Bit 3 - Set this bit to inject fault on the Read bus. Bit 7- Set this bit to inject fault on the corresponding request bus." range="31:24" rwaccess="R/W"/>
	<bitfield id="MSS_CR5B1_AXI_RD_BUS_SAFETY_FI_MAIN" width="8" begin="23" end="16" resetval="0x0" description="This bitfield is used to inject fault on Read, write, command and request bus on the main Interconnect.Bit 0 - Set this bit to inject fault on the Command bus. Bit 1 - Set this bit to inject fault on theWrite bus. Bit 2 - Set this bit to inject fault on the Write Status bus.Bit 3 - Set this bit to inject fault on the Read bus. Bit 7- Set this bit to inject fault on the corresponding request bus." range="23:16" rwaccess="R/W"/>
	<bitfield id="MSS_CR5B1_AXI_RD_BUS_SAFETY_FI_DATA" width="8" begin="15" end="8" resetval="0x0" description="Set bit 0 to 1'b1 to  inject sec and ded faults on [31:0] bits of data bus.Set bit 1 to 1'b1 to  inject sec and ded faults on [64:32] bits of data bus." range="15:8" rwaccess="R/W"/>
	<bitfield id="MSS_CR5B1_AXI_RD_BUS_SAFETY_FI_DED" width="1" begin="5" end="5" resetval="0x0" description="Set this bit to 1'b1 inject ded error on data at this port" range="5" rwaccess="R/W"/>
	<bitfield id="MSS_CR5B1_AXI_RD_BUS_SAFETY_FI_SEC" width="1" begin="4" end="4" resetval="0x0" description="Set this bit to 1'b1 to inject sec error on data at this port" range="4" rwaccess="R/W"/>
	<bitfield id="MSS_CR5B1_AXI_RD_BUS_SAFETY_FI_GLOBAL_SAFE_REQ" width="1" begin="3" end="3" resetval="0x0" description="Set this bit 1'b1 to inject fault for request signals on Safe Interconnect. This is enabled only when the 7th bit of safe bitfield of this register and particular bit coressponding to this port on the safe bitfield of this register is set HIGH" range="3" rwaccess="R/W"/>
	<bitfield id="MSS_CR5B1_AXI_RD_BUS_SAFETY_FI_GLOBAL_MAIN_REQ" width="1" begin="2" end="2" resetval="0x0" description="Set this bit to 1'b1 to inject fault for request signals on main Interconnect. This is enabled only when the 7th bit of main bitfield of this register and particular bit coressponding to this port on the main bitfield of this register is set HIGH" range="2" rwaccess="R/W"/>
	<bitfield id="MSS_CR5B1_AXI_RD_BUS_SAFETY_FI_GLOBAL_SAFE" width="1" begin="1" end="1" resetval="0x0" description="This is a global safe Fault injection signal. Set this bit to inject fault on all the safety buses of the safe interconnect except req signal. Writing a 1'b1 injects fault on interconnect." range="1" rwaccess="R/W"/>
	<bitfield id="MSS_CR5B1_AXI_RD_BUS_SAFETY_FI_GLOBAL_MAIN" width="1" begin="0" end="0" resetval="0x0" description="This is a global main Fault injection signal. Set this bit to inject fault on all the buses of the main interconnect except req signal. Writing a 1'b1 injects fault on interconnect." range="0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_R5FSS1_CORE1_AXI_RD_BUS_SAFETY_ERR" acronym="MSS_CTRL_MSS_R5FSS1_CORE1_AXI_RD_BUS_SAFETY_ERR" offset="98952" width="32" description="This Register provides the Error Status of Bus Safety Comparator of R5SS1 CORE1 AXI RD Initiator port.">
		<bitfield id="MSS_CR5B1_AXI_RD_BUS_SAFETY_ERR_DED" width="8" begin="31" end="24" resetval="0x0" description="This flag signals detection of dual error in Data at this port.Flag is generted for 32 bit segment of Data BusBit 0 - 1'b1 indicates ded on [31:0] bit of Data busBit 1 - 1'b1 indicates ded on [63:32] bit of Data busBit [7:2] - Unused. Set to 1'b0" range="31:24" rwaccess="R"/>
	<bitfield id="MSS_CR5B1_AXI_RD_BUS_SAFETY_ERR_SEC" width="8" begin="23" end="16" resetval="0x0" description="This flag signals detection of single error in Data at this port. Flag is generted for 32 bit segment of Data BusBit 0 - 1'b1 indicates sec on [31:0] bit of Data busBit 1 - 1'b1 indicates sec on [63:32] bit of Data busBit [7:2] - Unused. Set to 1'b0" range="23:16" rwaccess="R"/>
	<bitfield id="MSS_CR5B1_AXI_RD_BUS_SAFETY_ERR_COMP_CHECK" width="8" begin="15" end="8" resetval="0x0" description="This is used to verify the proper functioning of fault Injection on all the buses.1'b1 indicates error in the corresponding Bus has been injected successfully. Bit 0 - This is a Bitwise AND of error compares of all command bus signals.Bit 1 - This is a Bitwise AND of error compares of all write bus signals.Bit 2 - This is a Bitwise AND of error compares of all write status bus signals.Bit 3 - This is a Bitwise AND of error compares of all read bus signals.Bits [7:4] are unused." range="15:8" rwaccess="R"/>
	<bitfield id="MSS_CR5B1_AXI_RD_BUS_SAFETY_ERR_COMP_ERR" width="8" begin="7" end="0" resetval="0x0" description="1'b1 indicates error in the corresponding Bus whenever a fault is detected at any bus signalBit 0 - This is a Bitwise OR of error compares of all command bus signals.Bit 1 - This is a Bitwise OR of error compares of all write bus signals.Bit 2 - This is a Bitwise OR of error compares of all write status bus signals.Bit 3 - This is a Bitwise OR of error compares of all read bus signals.Bits [7:4] are unused." range="7:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_MSS_R5FSS1_CORE1_AXI_RD_BUS_SAFETY_ERR_STAT_DATA0" acronym="MSS_CTRL_MSS_R5FSS1_CORE1_AXI_RD_BUS_SAFETY_ERR_STAT_DATA0" offset="98956" width="32" description="This register Indicates the Error Syndrome of Data errors in Bus Safety Comparator of R5SS1 CORE1 AXI RD Initiator Port.">
		<bitfield id="MSS_CR5B1_AXI_RD_BUS_SAFETY_ERR_STAT_DATA0_D1" width="8" begin="15" end="8" resetval="0x0" description="Read this bitfield for Comparator status for Higher 32 bits [63:32] of data bus at this port.  It represent the position of the flipped bit in case of SEC." range="15:8" rwaccess="R"/>
	<bitfield id="MSS_CR5B1_AXI_RD_BUS_SAFETY_ERR_STAT_DATA0_D0" width="8" begin="7" end="0" resetval="0x0" description="Read this bitfield for Comparator status for lower 32 bits [31:0] of data bus at this port.  It represent the position of the flipped bit in case of SEC." range="7:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_MSS_R5FSS1_CORE1_AXI_RD_BUS_SAFETY_ERR_STAT_CMD" acronym="MSS_CTRL_MSS_R5FSS1_CORE1_AXI_RD_BUS_SAFETY_ERR_STAT_CMD" offset="98960" width="32" description="This register Indicates the Error Syndrome of Command errors in Bus Safety Comparator of R5SS1 CORE1 AXI RD Initiator Port.">
		<bitfield id="MSS_CR5B1_AXI_RD_BUS_SAFETY_ERR_STAT_CMD_STAT" width="32" begin="31" end="0" resetval="0x0" description="Read this bitfield for comparator status for command bus for this port. 1'b1 on any of the bits indicates an error on Command Bus" range="31:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_MSS_R5FSS1_CORE1_AXI_RD_BUS_SAFETY_ERR_STAT_READ" acronym="MSS_CTRL_MSS_R5FSS1_CORE1_AXI_RD_BUS_SAFETY_ERR_STAT_READ" offset="98964" width="32" description="This register Indicates the Error Syndrome of Read errors in Bus Safety Comparator of R5SS1 CORE1 AXI RD Initiator Port.">
		<bitfield id="MSS_CR5B1_AXI_RD_BUS_SAFETY_ERR_STAT_READ_STAT" width="32" begin="31" end="0" resetval="0x0" description="Read this bitfield for comapartor status for read signals at this port.  1'b1 on any of the bits indicates an error on Read bus." range="31:0" rwaccess="R"/>
	</register><register id="MSS_CTRL_MSS_R5SS0_CORE0_AXI_WR_BUS_SAFETY_CTRL" acronym="MSS_CTRL_MSS_R5SS0_CORE0_AXI_WR_BUS_SAFETY_CTRL" offset="98976" width="32" description="This register is used to Control and Configure the Interconnect  Safety Behaviour of R5SS0 CORE0 AXI WR Initiator Port.">
		<bitfield id="MSS_CR5A0_AXI_WR_BUS_SAFETY_CTRL_TYPE" width="8" begin="23" end="16" resetval="0x0" description="This bitfield gives a top level idea of the available bus [cmd,wr,ws,rd] for the particular Target/Initiator and whether it follows the VBUS protocol or not. Bit 0 - 1'b1 indicates the Command bus is implemented to this target/initiator else it is set to 1'b0. Bit 1 - 1'b1 indicates the write bus is implemented to this target/initiator else  it is set to 1'b0. Bit 2 - 1'b1 indicates the write status bus is implemented to this target/initiator else it is set to 1'b0. Bit 3 - 1'b1 indicates the read bus is implemented to this target/initiator else  it is set to 1'b0. Bit 4 - 1'b0 indicates the port follows the VBUS protocol else  it is set to 1'b1. Bits 5-7 are set to 3'b000." range="23:16" rwaccess="R"/>
	<bitfield id="MSS_CR5A0_AXI_WR_BUS_SAFETY_CTRL_ERR_CLEAR" width="1" begin="8" end="8" resetval="0x0" description="Set this bit to 1'b1 to clear the error status for this port" range="8" rwaccess="R/W"/>
	<bitfield id="MSS_CR5A0_AXI_WR_BUS_SAFETY_CTRL_ENABLE" width="3" begin="2" end="0" resetval="0x7" description="Set this bit to 3'b111 to enable the safety configuration for this port.  Set this bit to 3'b000 to disable the safety configuration for this port." range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_CTRL_MSS_R5SS0_CORE0_AXI_WR_BUS_SAFETY_FI" acronym="MSS_CTRL_MSS_R5SS0_CORE0_AXI_WR_BUS_SAFETY_FI" offset="98980" width="32" description="This register is used to Inject fault on the Interconnect  Safety comparator of  R5SS0 CORE0 AXI WR Initiator Port.">
